{
  "id": "1ac",
  "name": {
    "fr": "1ère Année Collège",
    "ar": "الأولى إعدادي",
    "en": "1st Year Middle School"
  },
  "chapters": [
    {
      "id": "svt-1ac-c1",
      "title": {
        "fr": "Chapitre 1 : Observation des milieux naturels",
        "ar": "الفصل 1: ملاحظة الأوساط الطبيعية",
        "en": "Chapter 1: Observation of natural environments"
      }
    },
    {
      "id": "svt-1ac-c2",
      "title": {
        "fr": "Chapitre 2 : Respiration dans différents milieux",
        "ar": "الفصل 2: التنفس في أوساط مختلفة",
        "en": "Chapter 2: Respiration in different environments"
      }
    },
    {
      "id": "svt-1ac-c3",
      "title": {
        "fr": "Chapitre 3 : Alimentation chez les êtres vivants",
        "ar": "الفصل 3: التغذية عند الكائنات الحية",
        "en": "Chapter 3: Nutrition in living beings"
      }
    },
    {
      "id": "svt-1ac-c4",
      "title": {
        "fr": "Chapitre 4 : Relations alimentaires et flux de matière et d'énergie",
        "ar": "الفصل 4: العلاقات الغذائية وتدفق المادة والطاقة",
        "en": "Chapter 4: Food relationships and flow of matter and energy"
      }
    },
    {
      "id": "svt-1ac-c5",
      "title": {
        "fr": "Chapitre 5 : Classification des êtres vivants et les équilibres naturels",
        "ar": "الفصل 5: تصنيف الكائنات الحية والتوازنات الطبيعية",
        "en": "Chapter 5: Classification of living beings and natural balances"
      }
    }
  ],
  "lessons": [
    {
      "id": "svt-1ac-l1",
      "topicId": "svt-1ac-c1",
      "status": "verified",
      "title": {
        "fr": "Séquence 1 : Diversité des milieux naturels",
        "ar": "التسلسل 1: تنوع الأوساط الطبيعية",
        "en": "Sequence 1: Diversity of natural environments"
      },
      "content": {
        "fr": "### Séquence 1 : Diversité des milieux naturels\n\n#### Introduction\nNotre planète abrite une grande variété de paysages : forêts, déserts, océans, lacs, etc. Ces différents endroits sont appelés des **milieux naturels**. Dans cette leçon, nous allons explorer ce qui compose ces milieux et comment leurs éléments interagissent.\n\n![une mosaïque de différents milieux naturels : forêt, désert, lac et océan](img_une_mosa_que_de_diff_rents_milieux_naturels_for_t__1762292307073.png)\n\n#### I. Les composantes d'un milieu naturel\nUn milieu naturel est constitué de deux types de composantes : les composantes vivantes et les composantes non vivantes.\n\n**1. Les composantes vivantes (La biocénose)**\nCe sont tous les êtres vivants qui peuplent le milieu. On les classe en trois catégories :\n*   **La faune :** L'ensemble des animaux (insectes, mammifères, oiseaux, poissons...).\n*   **La flore :** L'ensemble des végétaux (arbres, herbes, algues, mousses...).\n*   **Les micro-organismes :** Les êtres vivants invisibles à l'œil nu (bactéries, champignons microscopiques...). \nL'ensemble de ces êtres vivants est appelé la **biocénose**.\n\n**2. Les composantes non vivantes (Le biotope)**\nCe sont les éléments physiques et chimiques du milieu, qui ne sont pas vivants.\n*   **L'eau :** Sous forme de pluie, rivière, lac, humidité de l'air...\n*   **L'air :** Qui contient l'oxygène nécessaire à la respiration et le dioxyde de carbone pour les plantes.\n*   **Le sol et les roches :** Qui servent de support et de source de sels minéraux pour les végétaux.\n*   **La lumière et la température :** Provenant du soleil, elles sont des facteurs climatiques essentiels.\nL'ensemble de ces composantes non vivantes et de leurs caractéristiques (température, humidité, nature du sol...) est appelé le **biotope**.\n\n![un schéma simple d'un milieu naturel montrant les composantes vivantes comme des arbres et des animaux, et les composantes non-vivantes comme le soleil, l'eau et les roches](img_un_sch_ma_simple_d_un_milieu_naturel_montrant_les__1762292334377.png)\n\n#### II. La notion d'écosystème\nDans un milieu naturel, les composantes vivantes (biocénose) et non vivantes (biotope) ne sont pas isolées. Elles sont en interaction constante. Par exemple, les plantes utilisent l'eau et la lumière (biotope) pour grandir, et les animaux (biocénose) se nourrissent de plantes (biocénose).\n\nL'ensemble formé par le **biotope** (le milieu de vie) et la **biocénose** (les êtres qui y vivent), ainsi que les relations qui existent entre eux, est appelé un **écosystème**.\n\n**Écosystème = Biotope + Biocénose**\n\n![un diagramme expliquant la relation entre Biotope, Biocénose et Écosystème](img_un_diagramme_expliquant_la_relation_entre_biotope__1762292356543.png)\n\n#### III. La diversité des écosystèmes\nIl existe une grande diversité d'écosystèmes sur Terre, chacun avec son biotope et sa biocénose spécifiques.\n*   **L'écosystème forestier :** Température modérée, humidité élevée, sol riche. On y trouve des arbres, des fougères, des cerfs, des sangliers, des insectes...\n*   **L'écosystème désertique :** Température très élevée le jour et basse la nuit, très peu de pluie, sol sableux. La faune et la flore sont adaptées (dromadaires, scorpions, cactus...).\n*   **L'écosystème aquatique (lac) :** Le biotope est l'eau avec ses propriétés (température, salinité, oxygène). La biocénose inclut des poissons, des algues, des roseaux, des grenouilles...",
        "ar": "### المحور 1: تنوع الأوساط الطبيعية\n\n#### مقدمة\nيحتضن كوكبنا مجموعة متنوعة من المناظر الطبيعية: غابات، صحاري، محيطات، بحيرات، إلخ. تسمى هذه الأماكن المختلفة **أوساطًا طبيعية**. في هذا الدرس، سوف نستكشف مكونات هذه الأوساط وكيفية تفاعل عناصرها.\n\n![une mosaïque de différents milieux naturels : forêt, désert, lac et océan](img_une_mosa_que_de_diff_rents_milieux_naturels_for_t__1762292307073.png)\n\n#### I. مكونات الوسط الطبيعي\nيتكون الوسط الطبيعي من نوعين من المكونات: المكونات الحية والمكونات غير الحية.\n\n**1. المكونات الحية (العشيرة الإحيائية)**\nهي جميع الكائنات الحية التي تعيش في الوسط. وتصنف إلى ثلاث فئات:\n*   **الوحيش (Faune):** مجموع الحيوانات (حشرات، ثدييات، طيور، أسماك...).\n*   **النبيت (Flore):** مجموع النباتات (أشجار، أعشاب، طحالب، حزازيات...).\n*   **الكائنات المجهرية:** الكائنات الحية غير المرئية بالعين المجردة (بكتيريا، فطريات مجهرية...).\nيطلق على مجموع هذه الكائنات الحية اسم **العشيرة الإحيائية (Biocénose)**.\n\n**2. المكونات غير الحية (المَحْيَا)**\nهي العناصر الفيزيائية والكيميائية للوسط، وهي غير حية.\n*   **الماء:** على شكل أمطار، أنهار، بحيرات، رطوبة الهواء...\n*   **الهواء:** الذي يحتوي على الأكسجين اللازم للتنفس وثاني أكسيد الكربون للنباتات.\n*   **التربة والصخور:** التي تعتبر دعامة ومصدرًا للأملاح المعدنية للنباتات.\n*   **الضوء ودرجة الحرارة:** مصدرهما الشمس، وهما عاملان مناخيان أساسيان.\nيطلق على مجموع هذه المكونات غير الحية وخصائصها (درجة الحرارة، الرطوبة، طبيعة التربة...) اسم **المَحْيَا (Biotope)**.\n\n![un schéma simple d'un milieu naturel montrant les composantes vivantes comme des arbres et des animaux, et les composantes non-vivantes comme le soleil, l'eau et les roches](img_un_sch_ma_simple_d_un_milieu_naturel_montrant_les__1762292334377.png)\n\n#### II. مفهوم الحميلة البيئية\nفي الوسط الطبيعي، لا تكون المكونات الحية (العشيرة الإحيائية) والمكونات غير الحية (المحيا) معزولة. بل هي في تفاعل مستمر. على سبيل المثال، تستخدم النباتات الماء والضوء (المحيا) للنمو، وتتغذى الحيوانات (العشيرة الإحيائية) على النباتات (العشيرة الإحيائية).\n\nالمجموع المكون من **المحيا** (وسط العيش) و**العشيرة الإحيائية** (الكائنات التي تعيش فيه)، بالإضافة إلى العلاقات القائمة بينها، يسمى **حميلة بيئية (Écosystème)**.\n\n**حميلة بيئية = محيا + عشيرة إحيائية**\n\n![un diagramme expliquant la relation entre Biotope, Biocénose et Écosystème](img_un_diagramme_expliquant_la_relation_entre_biotope__1762292356543.png)\n\n#### III. تنوع الحمائل البيئية\nيوجد تنوع كبير في الحمائل البيئية على الأرض، لكل منها محيا وعشيرة إحيائية خاصة بها.\n*   **الحميلة البيئية الغابوية:** درجة حرارة معتدلة، رطوبة عالية، تربة غنية. نجد فيها أشجارًا، سراخس، أيائل، خنازير برية، حشرات...\n*   **الحميلة البيئية الصحراوية:** درجة حرارة مرتفعة جدًا نهارًا ومنخفضة ليلًا، أمطار قليلة جدًا، تربة رملية. الوحيش والنبيت متكيفان مع هذه الظروف (جمال، عقارب، صبار...).\n*   **الحميلة البيئية المائية (بحيرة):** المحيا هو الماء بخصائصه (درجة الحرارة، الملوحة، الأكسجين). تشمل العشيرة الإحيائية الأسماك، والطحالب، والقصب، والضفادع...",
        "en": "### Sequence 1: Diversity of Natural Environments\n\n#### Introduction\nOur planet is home to a wide variety of landscapes: forests, deserts, oceans, lakes, etc. These different places are called **natural environments**. In this lesson, we will explore what makes up these environments and how their elements interact.\n\n![une mosaïque de différents milieux naturels : forêt, désert, lac et océan](img_une_mosa_que_de_diff_rents_milieux_naturels_for_t__1762292307073.png)\n\n#### I. The Components of a Natural Environment\nA natural environment consists of two types of components: living components and non-living components.\n\n**1. Living Components (The Biocenosis)**\nThese are all the living beings that inhabit the environment. They are classified into three categories:\n*   **Fauna:** All the animals (insects, mammals, birds, fish...).\n*   **Flora:** All the plants (trees, grasses, algae, mosses...).\n*   **Micro-organisms:** Living beings invisible to the naked eye (bacteria, microscopic fungi...).\nThe entire set of these living beings is called the **biocenosis**.\n\n**2. Non-living Components (The Biotope)**\nThese are the physical and chemical elements of the environment that are not alive.\n*   **Water:** In the form of rain, rivers, lakes, air humidity...\n*   **Air:** Which contains the oxygen necessary for respiration and carbon dioxide for plants.\n*   **Soil and Rocks:** Which serve as support and a source of mineral salts for plants.\n*   **Light and Temperature:** Coming from the sun, they are essential climatic factors.\nThe entire set of these non-living components and their characteristics (temperature, humidity, soil type...) is called the **biotope**.\n\n![un schéma simple d'un milieu naturel montrant les composantes vivantes comme des arbres et des animaux, et les composantes non-vivantes comme le soleil, l'eau et les roches](img_un_sch_ma_simple_d_un_milieu_naturel_montrant_les__1762292334377.png)\n\n#### II. The Concept of an Ecosystem\nIn a natural environment, the living (biocenosis) and non-living (biotope) components are not isolated. They are in constant interaction. For example, plants use water and light (biotope) to grow, and animals (biocenosis) feed on plants (biocenosis).\n\nThe whole formed by the **biotope** (the living environment) and the **biocenosis** (the beings that live in it), as well as the relationships that exist between them, is called an **ecosystem**.\n\n**Ecosystem = Biotope + Biocenosis**\n\n![un diagramme expliquant la relation entre Biotope, Biocénose et Écosystème](img_un_diagramme_expliquant_la_relation_entre_biotope__1762292356543.png)\n\n#### III. The Diversity of Ecosystems\nThere is a great diversity of ecosystems on Earth, each with its specific biotope and biocenosis.\n*   **The Forest Ecosystem:** Moderate temperature, high humidity, rich soil. It contains trees, ferns, deer, wild boars, insects...\n*   **The Desert Ecosystem:** Very high temperature during the day and low at night, very little rain, sandy soil. The fauna and flora are adapted (camels, scorpions, cacti...).\n*   **The Aquatic Ecosystem (Lake):** The biotope is the water with its properties (temperature, salinity, oxygen). The biocenosis includes fish, algae, reeds, frogs..."
      },
      "backgroundImage": "img_background_1762292292903.png"
    },
    {
      "id": "svt-1ac-l2",
      "topicId": "svt-1ac-c1",
      "status": "verified",
      "title": {
        "fr": "Séquence 2 : Diversité des constituants des milieux naturels",
        "ar": "التسلسل 2: تنوع مكونات الأوساط الطبيعية",
        "en": "Sequence 2: Diversity of the components of natural environments"
      },
      "content": {
        "fr": "### Séquence 2 : Diversité des constituants des milieux naturels\n\n**Introduction**\nUn milieu naturel est un lieu où des êtres vivants (animaux, végétaux...) interagissent avec des éléments non-vivants (eau, air, roches...). Pour étudier un milieu, il faut d'abord apprendre à identifier ses différentes composantes. Comment peut-on distinguer les constituants d'un milieu naturel ?\n\n**I. Mise en évidence des composantes d'un milieu naturel**\nL'exploration d'un milieu naturel, comme une forêt ou un lac, que ce soit par une sortie sur le terrain ou l'étude de documents (photos, vidéos), permet de réaliser un inventaire des éléments présents.\n\n![Photo d'une forêt marocaine avec des cèdres, un ruisseau, des rochers, et quelques animaux comme un macaque de Barbarie et des oiseaux](img_photo_d_une_for_t_marocaine_avec_des_c_dres_un_rui_1762292816118.png)\n\nOn peut observer :\n- Des éléments variés comme des arbres (chênes, pins), des animaux (insectes, oiseaux, écureuils), de la mousse sur les rochers.\n- Des éléments non-vivants comme les rochers eux-mêmes, l'eau du ruisseau, l'air que nous respirons, et le sol.\n\n**II. Classification des composantes du milieu naturel**\nLes éléments observés peuvent être classés en deux grandes catégories.\n\n**1. Les composantes vivantes (La biocénose)**\nCe sont tous les êtres vivants du milieu. Ils partagent des caractéristiques communes : ils naissent, se nourrissent, respirent, grandissent, se reproduisent et meurent. On les appelle aussi les **constituants biologiques**.\nOn peut les subdiviser en trois groupes :\n- **La faune** : L'ensemble des animaux (mammifères, oiseaux, reptiles, insectes...).\n- **La flore** : L'ensemble des végétaux (arbres, arbustes, herbes, mousses, algues...).\n- **Les micro-organismes** : Des êtres vivants de très petite taille, invisibles à l'œil nu, comme les bactéries et les champignons microscopiques, présents dans le sol, l'eau et l'air.\n\n**2. Les composantes non-vivantes (Le biotope)**\nCe sont les éléments qui ne présentent pas les caractéristiques de la vie. On les appelle aussi les **constituants physiques ou minéraux**.\nLes principales composantes non-vivantes sont :\n- **L'eau** : Sous différentes formes (rivière, lac, pluie, humidité de l'air).\n- **L'air** : Le gaz qui nous entoure, essentiel à la respiration de nombreux êtres vivants.\n- **Le sol et les roches** : Le support sur lequel vivent et se développent les végétaux, et qui sert d'abri à de nombreux animaux.\n\n**Conclusion**\nUn milieu naturel est donc constitué d'une partie vivante, la **biocénose**, et d'une partie non-vivante, le **biotope**. L'ensemble de ces deux parties et les relations qui existent entre elles forment ce qu'on appelle un **écosystème**.",
        "ar": "### الحصة 2: تنوع مكونات الأوساط الطبيعية\n\n**مقدمة**\nالوسط الطبيعي هو مكان تعيش فيه كائنات حية (حيوانات، نباتات...) وتتفاعل مع عناصر غير حية (ماء، هواء، صخور...). لدراسة وسط ما، يجب أولاً تعلم كيفية تحديد مكوناته المختلفة. كيف يمكن التمييز بين مكونات الوسط الطبيعي؟\n\n**I. الكشف عن مكونات وسط طبيعي**\nإن استكشاف وسط طبيعي، مثل غابة أو بحيرة، سواء من خلال خرجة ميدانية أو دراسة وثائق (صور، فيديوهات)، يسمح بإجراء جرد للعناصر الموجودة.\n\n![Photo d'une forêt marocaine avec des cèdres, un ruisseau, des rochers, et quelques animaux comme un macaque de Barbarie et des oiseaux](img_photo_d_une_for_t_marocaine_avec_des_c_dres_un_rui_1762292816118.png)\n\nيمكننا ملاحظة:\n- عناصر متنوعة مثل الأشجار (البلوط، الصنوبر)، والحيوانات (الحشرات، الطيور، السناجب)، والطحالب على الصخور.\n- عناصر غير حية مثل الصخور نفسها، ومياه النهر، والهواء الذي نتنفسه، والتربة.\n\n**II. تصنيف مكونات الوسط الطبيعي**\nيمكن تصنيف العناصر الملاحظة إلى فئتين رئيسيتين.\n\n**1. المكونات الحية (العشيرة الإحيائية - Biocénose)**\nهي جميع الكائنات الحية في الوسط. تشترك في خصائص مشتركة: تولد، تتغذى، تتنفس، تنمو، تتكاثر وتموت. تسمى أيضًا **المكونات البيولوجية**.\nيمكن تقسيمها إلى ثلاث مجموعات:\n- **الوحيش (Faune)**: مجموع الحيوانات (الثدييات، الطيور، الزواحف، الحشرات...).\n- **النبيت (Flore)**: مجموع النباتات (الأشجار، الشجيرات، الأعشاب، الطحالب، ...).\n- **الكائنات المجهرية**: كائنات حية صغيرة جدًا، غير مرئية بالعين المجردة، مثل البكتيريا والفطريات المجهرية، الموجودة في التربة والماء والهواء.\n\n**2. المكونات غير الحية (المَحْيَا - Biotope)**\nهي العناصر التي لا تظهر عليها خصائص الحياة. تسمى أيضًا **المكونات الفيزيائية أو المعدنية**.\nالمكونات غير الحية الرئيسية هي:\n- **الماء**: بأشكاله المختلفة (نهر، بحيرة، مطر، رطوبة الهواء).\n- **الهواء**: الغاز الذي يحيط بنا، وهو ضروري لتنفس العديد من الكائنات الحية.\n- **التربة والصخور**: الدعامة التي تعيش وتنمو عليها النباتات، وتعمل كمأوى للعديد من الحيوانات.\n\n**خلاصة**\nيتكون الوسط الطبيعي إذن من جزء حي، هو **العشيرة الإحيائية (Biocénose)**، وجزء غير حي، هو **المحيا (Biotope)**. مجموع هذين الجزأين والعلاقات القائمة بينهما يشكل ما يسمى **النظام البيئي (Écosystème)**.",
        "en": "### Sequence 2: Diversity of Constituents in Natural Environments\n\n**Introduction**\nA natural environment is a place where living beings (animals, plants...) interact with non-living elements (water, air, rocks...). To study an environment, one must first learn to identify its different components. How can we distinguish the constituents of a natural environment?\n\n**I. Identifying the Components of a Natural Environment**\nExploring a natural environment, such as a forest or a lake, either through a field trip or by studying documents (photos, videos), allows us to make an inventory of the elements present.\n\n![Photo d'une forêt marocaine avec des cèdres, un ruisseau, des rochers, et quelques animaux comme un macaque de Barbarie et des oiseaux](img_photo_d_une_for_t_marocaine_avec_des_c_dres_un_rui_1762292816118.png)\n\nWe can observe:\n- Various elements like trees (oaks, pines), animals (insects, birds, squirrels), and moss on rocks.\n- Non-living elements like the rocks themselves, the water in the stream, the air we breathe, and the soil.\n\n**II. Classification of the Components of the Natural Environment**\nThe observed elements can be classified into two main categories.\n\n**1. Living Components (Biocenosis)**\nThese are all the living beings in the environment. They share common characteristics: they are born, feed, breathe, grow, reproduce, and die. They are also called **biological constituents**.\nThey can be subdivided into three groups:\n- **Fauna**: All the animals (mammals, birds, reptiles, insects...).\n- **Flora**: All the plants (trees, shrubs, herbs, mosses, algae...).\n- **Microorganisms**: Very small living beings, invisible to the naked eye, such as bacteria and microscopic fungi, present in the soil, water, and air.\n\n**2. Non-Living Components (Biotope)**\nThese are the elements that do not exhibit the characteristics of life. They are also called **physical or mineral constituents**.\nThe main non-living components are:\n- **Water**: In different forms (river, lake, rain, air humidity).\n- **Air**: The gas that surrounds us, essential for the respiration of many living beings.\n- **Soil and Rocks**: The support on which plants live and grow, and which serves as shelter for many animals.\n\n**Conclusion**\nA natural environment is therefore composed of a living part, the **biocenosis**, and a non-living part, the **biotope**. The combination of these two parts and the relationships between them form what is called an **ecosystem**."
      },
      "backgroundImage": "img_background_1762292869918.jpg"
    },
    {
      "id": "svt-1ac-l3",
      "topicId": "svt-1ac-c1",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 3 : La cellule en tant qu'unité structurelle de l'être vivant",
        "ar": "التسلسل 3: الخلية كوحدة بنيوية للكائن الحي",
        "en": "Sequence 3: The cell as a structural unit of the living being"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l4",
      "topicId": "svt-1ac-c2",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 1 : Respiration chez certains êtres vivants",
        "ar": "التسلسل 1: التنفس عند بعض الكائنات الحية",
        "en": "Sequence 1: Respiration in certain living beings"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l5",
      "topicId": "svt-1ac-c2",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 2 : Adaptation de la respiration au milieu aérien chez les animaux",
        "ar": "التسلسل 2: تكيف التنفس مع الوسط الهوائي عند الحيوانات",
        "en": "Sequence 2: Adaptation of respiration to the aerial environment in animals"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l6",
      "topicId": "svt-1ac-c2",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 3 : Adaptation de la respiration des insectes et des plantes au milieu aérien",
        "ar": "التسلسل 3: تكيف تنفس الحشرات والنباتات مع الوسط الهوائي",
        "en": "Sequence 3: Adaptation of respiration in insects and plants to the aerial environment"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l7",
      "topicId": "svt-1ac-c2",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 4 : Adaptation de la respiration des êtres vivants au milieu aquatique",
        "ar": "التسلسل 4: تكيف تنفس الكائنات الحية مع الوسط المائي",
        "en": "Sequence 4: Adaptation of respiration of living beings to the aquatic environment"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l8",
      "topicId": "svt-1ac-c3",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 1 : Régime alimentaire omnivore chez l'Homme",
        "ar": "التسلسل 1: النظام الغذائي القارت عند الإنسان",
        "en": "Sequence 1: Omnivorous diet in humans"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l9",
      "topicId": "svt-1ac-c3",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 2 : Étude comparative de deux régimes alimentaires : herbivore et carnivore",
        "ar": "التسلسل 2: دراسة مقارنة لنظامين غذائيين: العاشب واللاحم",
        "en": "Sequence 2: Comparative study of two diets: herbivore and carnivore"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l10",
      "topicId": "svt-1ac-c3",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 3 : La nutrition chez les plantes",
        "ar": "التسلسل 3: التغذية عند النباتات",
        "en": "Sequence 3: Nutrition in plants"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l11",
      "topicId": "svt-1ac-c4",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 1 : Les chaînes et réseaux alimentaires",
        "ar": "التسلسل 1: السلاسل والشبكات الغذائية",
        "en": "Sequence 1: Food chains and webs"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l12",
      "topicId": "svt-1ac-c4",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 2 : La production de la matière et le flux d'énergie",
        "ar": "التسلسل 2: إنتاج المادة وتدفق الطاقة",
        "en": "Sequence 2: Production of matter and energy flow"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l13",
      "topicId": "svt-1ac-c5",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 1 : Classification des végétaux",
        "ar": "التسلسل 1: تصنيف النباتات",
        "en": "Sequence 1: Classification of plants"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l14",
      "topicId": "svt-1ac-c5",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 2 : Classification des animaux",
        "ar": "التسلسل 2: تصنيف الحيوانات",
        "en": "Sequence 2: Classification of animals"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l15",
      "topicId": "svt-1ac-c5",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 3 : Les équilibres naturels",
        "ar": "التسلسل 3: التوازنات الطبيعية",
        "en": "Sequence 3: Natural balances"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    }
  ],
  "exercises": [
    {
      "id": "e-1762292229888",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l1",
      "title": {
        "fr": "Exercice 1 : Définitions",
        "ar": "تمرين 1: تعاريف",
        "en": "Exercise 1: Definitions"
      },
      "content": {
        "fr": "Donnez la définition des termes suivants :\n1. Milieu naturel\n2. Biocénose\n3. Biotope\n4. Écosystème",
        "ar": "أعط تعريف المصطلحات التالية:\n1. وسط طبيعي\n2. عشيرة إحيائية\n3. محيا\n4. حميلة بيئية",
        "en": "Give the definition of the following terms:\n1. Natural environment\n2. Biocenosis\n3. Biotope\n4. Ecosystem"
      },
      "solution": {
        "fr": "1. **Milieu naturel :** Un espace qui n'a pas été profondément modifié par l'homme, caractérisé par ses composantes vivantes et non vivantes.\n2. **Biocénose :** L'ensemble de tous les êtres vivants (faune, flore, micro-organismes) dans un milieu donné.\n3. **Biotope :** L'ensemble des composantes non vivantes (eau, air, sol, lumière...) et des conditions physico-chimiques d'un milieu.\n4. **Écosystème :** L'ensemble formé par un biotope et une biocénose, ainsi que les interactions entre eux.",
        "ar": "1. **وسط طبيعي:** فضاء لم يغيره الإنسان بشكل كبير، ويتميز بمكوناته الحية وغير الحية.\n2. **عشيرة إحيائية:** مجموع كل الكائنات الحية (وحيش، نبيت، كائنات مجهرية) في وسط معين.\n3. **محيا:** مجموع المكونات غير الحية (ماء، هواء، تربة، ضوء...) والظروف الفيزيوكيميائية لوسط ما.\n4. **حميلة بيئية:** المجموع المكون من المحيا والعشيرة الإحيائية، بالإضافة إلى التفاعلات القائمة بينهما.",
        "en": "1. **Natural environment:** A space that has not been significantly modified by humans, characterized by its living and non-living components.\n2. **Biocenosis:** The set of all living beings (fauna, flora, micro-organisms) in a given environment.\n3. **Biotope:** The set of non-living components (water, air, soil, light...) and the physicochemical conditions of an environment.\n4. **Ecosystem:** The unit formed by a biotope and a biocenosis, as well as the interactions between them."
      }
    },
    {
      "id": "e-1762292229889",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l1",
      "title": {
        "fr": "Exercice 2 : Identifier les composantes",
        "ar": "تمرين 2: تحديد المكونات",
        "en": "Exercise 2: Identifying Components"
      },
      "content": {
        "fr": "Dans une mare, on observe les éléments suivants : grenouilles, nénuphars, eau, poissons, larves de moustiques, lumière du soleil, cailloux au fond, air. Classez ces éléments en composantes vivantes (biocénose) et composantes non vivantes (biotope).",
        "ar": "في بركة ماء، نلاحظ العناصر التالية: ضفادع، زنابق الماء، ماء، أسماك، يرقات البعوض، ضوء الشمس، حصى في القاع، هواء. صنف هذه العناصر إلى مكونات حية (عشيرة إحيائية) ومكونات غير حية (محيا).",
        "en": "In a pond, the following elements are observed: frogs, water lilies, water, fish, mosquito larvae, sunlight, pebbles at the bottom, air. Classify these elements into living components (biocenosis) and non-living components (biotope)."
      },
      "solution": {
        "fr": "*   **Composantes vivantes (Biocénose) :** grenouilles, nénuphars, poissons, larves de moustiques.\n*   **Composantes non vivantes (Biotope) :** eau, lumière du soleil, cailloux, air.",
        "ar": "*   **مكونات حية (عشيرة إحيائية):** ضفادع، زنابق الماء، أسماك، يرقات البعوض.\n*   **مكونات غير حية (محيا):** ماء، ضوء الشمس، حصى، هواء.",
        "en": "*   **Living Components (Biocenosis):** frogs, water lilies, fish, mosquito larvae.\n*   **Non-living Components (Biotope):** water, sunlight, pebbles, air."
      }
    },
    {
      "id": "e-1762292229891",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l1",
      "title": {
        "fr": "Exercice 3 : Vrai ou Faux",
        "ar": "تمرين 3: صحيح أم خطأ",
        "en": "Exercise 3: True or False"
      },
      "content": {
        "fr": "Répondez par Vrai ou Faux et corrigez les affirmations fausses.\n1. Le biotope est l'ensemble des êtres vivants d'un milieu.\n2. Une forêt est un exemple d'écosystème.\n3. L'eau et l'air font partie de la biocénose.\n4. L'écosystème est l'interaction entre la faune et la flore uniquement.",
        "ar": "أجب بصحيح أو خطأ وصحح العبارات الخاطئة.\n1. المحيا هو مجموع الكائنات الحية في وسط ما.\n2. الغابة مثال لحميلة بيئية.\n3. الماء والهواء جزء من العشيرة الإحيائية.\n4. الحميلة البيئية هي التفاعل بين الوحيش والنبيت فقط.",
        "en": "Answer with True or False and correct the false statements.\n1. The biotope is the set of living beings in an environment.\n2. A forest is an example of an ecosystem.\n3. Water and air are part of the biocenosis.\n4. An ecosystem is the interaction between only fauna and flora."
      },
      "solution": {
        "fr": "1. **Faux.** Le biotope est l'ensemble des composantes **non vivantes** d'un milieu. La biocénose est l'ensemble des êtres vivants.\n2. **Vrai.**\n3. **Faux.** L'eau et l'air font partie du **biotope** (composantes non vivantes).\n4. **Faux.** L'écosystème est l'interaction entre **le biotope (toutes les composantes non vivantes) et la biocénose (tous les êtres vivants)**.",
        "ar": "1. **خطأ.** المحيا هو مجموع المكونات **غير الحية** في وسط ما. العشيرة الإحيائية هي مجموع الكائنات الحية.\n2. **صحيح.**\n3. **خطأ.** الماء والهواء جزء من **المحيا** (مكونات غير حية).\n4. **خطأ.** الحميلة البيئية هي التفاعل بين **المحيا (كل المكونات غير الحية) والعشيرة الإحيائية (كل الكائنات الحية)**.",
        "en": "1. **False.** The biotope is the set of **non-living** components of an environment. The biocenosis is the set of living beings.\n2. **True.**\n3. **False.** Water and air are part of the **biotope** (non-living components).\n4. **False.** An ecosystem is the interaction between **the biotope (all non-living components) and the biocenosis (all living beings)**."
      }
    },
    {
      "id": "e-1762292707758",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l2",
      "title": {
        "fr": "Exercice 1 : Classer les composantes",
        "ar": "تمرين 1: تصنيف المكونات",
        "en": "Exercise 1: Classifying Components"
      },
      "content": {
        "fr": "Classez les éléments suivants dans un tableau à deux colonnes (Composantes vivantes / Composantes non-vivantes) : Papillon, Eau de mer, Champignon, Sable, Air, Arbre (Chêne), Roche, Bactérie.",
        "ar": "صنف العناصر التالية في جدول من عمودين (مكونات حية / مكونات غير حية): فراشة، ماء البحر، فطر، رمل، هواء، شجرة (بلوط)، صخرة، بكتيريا.",
        "en": "Classify the following elements into a two-column table (Living components / Non-living components): Butterfly, Seawater, Mushroom, Sand, Air, Tree (Oak), Rock, Bacterium."
      },
      "solution": {
        "fr": "**Composantes vivantes :** Papillon, Champignon, Arbre (Chêne), Bactérie.\n**Composantes non-vivantes :** Eau de mer, Sable, Air, Roche.",
        "ar": "**مكونات حية:** فراشة، فطر، شجرة (بلوط)، بكتيريا.\n**مكونات غير حية:** ماء البحر، رمل، هواء، صخرة.",
        "en": "**Living components:** Butterfly, Mushroom, Tree (Oak), Bacterium.\n**Non-living components:** Seawater, Sand, Air, Rock."
      }
    },
    {
      "id": "e-1762292707760",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l2",
      "title": {
        "fr": "Exercice 2 : Vrai ou Faux",
        "ar": "تمرين 2: صحيح أم خطأ",
        "en": "Exercise 2: True or False"
      },
      "content": {
        "fr": "Répondez par Vrai ou Faux et corrigez les affirmations fausses :\n1. Le biotope représente l'ensemble des êtres vivants d'un milieu.\n2. La respiration est une caractéristique des composantes non-vivantes.\n3. Le sol est une composante vivante car il abrite des êtres vivants.\n4. La faune et la flore font partie de la biocénose.",
        "ar": "أجب بصحيح أو خطأ وصحح العبارات الخاطئة:\n1. المحيا (Biotope) يمثل مجموع الكائنات الحية في وسط ما.\n2. التنفس هو من خصائص المكونات غير الحية.\n3. التربة مكون حي لأنها تأوي كائنات حية.\n4. الوحيش والنبيت جزء من العشيرة الإحيائية (Biocénose).",
        "en": "Answer with True or False and correct the false statements:\n1. The biotope represents all the living beings in an environment.\n2. Respiration is a characteristic of non-living components.\n3. The soil is a living component because it shelters living beings.\n4. Fauna and flora are part of the biocenosis."
      },
      "solution": {
        "fr": "1. **Faux**. Le biotope représente l'ensemble des composantes non-vivantes. C'est la biocénose qui représente l'ensemble des êtres vivants.\n2. **Faux**. La respiration est une caractéristique des êtres vivants.\n3. **Faux**. Le sol est une composante non-vivante (minérale), même s'il contient des êtres vivants (micro-organismes, vers de terre...). \n4. **Vrai**.",
        "ar": "1. **خطأ**. المحيا (Biotope) يمثل مجموع المكونات غير الحية. العشيرة الإحيائية (Biocénose) هي التي تمثل مجموع الكائنات الحية.\n2. **خطأ**. التنفس هو من خصائص الكائنات الحية.\n3. **خطأ**. التربة هي مكون غير حي (معدني)، على الرغم من أنها تحتوي على كائنات حية (كائنات مجهرية، ديدان الأرض...).\n4. **صحيح**.",
        "en": "1. **False**. The biotope represents all the non-living components. It is the biocenosis that represents all the living beings.\n2. **False**. Respiration is a characteristic of living beings.\n3. **False**. The soil is a non-living component (mineral), even though it contains living beings (microorganisms, earthworms...).\n4. **True**."
      }
    },
    {
      "id": "e-1762292707761",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l2",
      "title": {
        "fr": "Exercice 3 : Compléter le texte",
        "ar": "تمرين 3: أتمم النص",
        "en": "Exercise 3: Fill in the blanks"
      },
      "content": {
        "fr": "Complétez le paragraphe suivant avec les mots appropriés : écosystème, vivantes, biotope, non-vivantes, biocénose.\nUn milieu naturel est formé de composantes ________ et de composantes ________. L'ensemble des êtres vivants est appelé la ________, tandis que l'ensemble des éléments minéraux (eau, air, sol) forme le ________. La relation entre ces deux ensembles constitue un ________.",
        "ar": "أتمم الفقرة التالية بالكلمات المناسبة: نظام بيئي، حية، محيا (biotope)، غير حية، عشيرة إحيائية (biocénose).\nيتكون الوسط الطبيعي من مكونات ________ ومكونات ________. يطلق على مجموع الكائنات الحية اسم ________، بينما يشكل مجموع العناصر المعدنية (الماء، الهواء، التربة) ________. العلاقة بين هاتين المجموعتين تشكل ________.",
        "en": "Complete the following paragraph with the appropriate words: ecosystem, living, biotope, non-living, biocenosis.\nA natural environment is made up of ________ components and ________ components. The set of all living beings is called the ________, while the set of mineral elements (water, air, soil) forms the ________. The relationship between these two sets constitutes an ________."
      },
      "solution": {
        "fr": "Un milieu naturel est formé de composantes **vivantes** et de composantes **non-vivantes**. L'ensemble des êtres vivants est appelé la **biocénose**, tandis que l'ensemble des éléments minéraux (eau, air, sol) forme le **biotope**. La relation entre ces deux ensembles constitue un **écosystème**.",
        "ar": "يتكون الوسط الطبيعي من مكونات **حية** ومكونات **غير حية**. يطلق على مجموع الكائنات الحية اسم **العشيرة الإحيائية (biocénose)**، بينما يشكل مجموع العناصر المعدنية (الماء، الهواء، التربة) **المحيا (biotope)**. العلاقة بين هاتين المجموعتين تشكل **نظامًا بيئيًا**.",
        "en": "A natural environment is made up of **living** components and **non-living** components. The set of all living beings is called the **biocenosis**, while the set of mineral elements (water, air, soil) forms the **biotope**. The relationship between these two sets constitutes an **ecosystem**."
      }
    }
  ],
  "summaries": [
    {
      "id": "s-act-1762292229889",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l1",
      "title": {
        "fr": "Bilan des activités",
        "ar": "حصيلة الأنشطة",
        "en": "Summary of Activities"
      },
      "content": {
        "fr": "L'activité principale de cette séquence est la **sortie sur le terrain** (ou l'étude de documents d'un milieu naturel comme une forêt ou un lac).\n\n1.  **Objectif :** Découvrir et identifier les différentes composantes d'un milieu naturel.\n2.  **Méthode :** \n    *   Observation directe du milieu.\n    *   Recensement des êtres vivants observés (animaux, végétaux) et des éléments non vivants (eau, type de sol, roches, ensoleillement).\n    *   Utilisation d'une grille pour classer les éléments en deux catégories : vivants (biocénose) et non vivants (biotope).\n3.  **Conclusion de l'activité :** Nous avons constaté que chaque milieu naturel est un système complexe où des êtres vivants très variés (biocénose) vivent sur un support physique (biotope) et interagissent avec lui. Cet ensemble forme un écosystème.",
        "ar": "النشاط الرئيسي لهذا المحور هو **الخرجة الميدانية** (أو دراسة وثائق لوسط طبيعي مثل غابة أو بحيرة).\n\n1.  **الهدف:** اكتشاف وتحديد المكونات المختلفة لوسط طبيعي.\n2.  **الطريقة:**\n    *   الملاحظة المباشرة للوسط.\n    *   إحصاء الكائنات الحية الملاحظة (حيوانات، نباتات) والعناصر غير الحية (ماء، نوع التربة، صخور، تشميس).\n    *   استخدام شبكة لتصنيف العناصر إلى فئتين: حية (عشيرة إحيائية) وغير حية (محيا).\n3.  **استنتاج النشاط:** لقد لاحظنا أن كل وسط طبيعي هو نظام معقد حيث تعيش كائنات حية متنوعة جدًا (عشيرة إحيائية) على دعامة فيزيائية (محيا) وتتفاعل معها. هذا المجموع يشكل حميلة بيئية.",
        "en": "The main activity for this sequence is a **field trip** (or the study of documents about a natural environment like a forest or a lake).\n\n1.  **Objective:** To discover and identify the different components of a natural environment.\n2.  **Method:**\n    *   Direct observation of the environment.\n    *   Listing the observed living beings (animals, plants) and non-living elements (water, soil type, rocks, sunlight exposure).\n    *   Using a grid to classify the elements into two categories: living (biocenosis) and non-living (biotope).\n3.  **Conclusion of the activity:** We found that each natural environment is a complex system where a wide variety of living beings (biocenosis) live on a physical substrate (biotope) and interact with it. This entire unit forms an ecosystem."
      }
    },
    {
      "id": "s-syn-1762292229891",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l1",
      "title": {
        "fr": "Schéma de synthèse",
        "ar": "خطاطة تركيبية",
        "en": "Synthesis Summary"
      },
      "content": {
        "fr": "#### Diversité des milieux naturels\n\n*   Un **milieu naturel** est un lieu de vie avec ses propres caractéristiques.\n*   Il est composé de :\n    *   **Composantes Vivantes (Biocénose) :**\n        *   Faune (animaux)\n        *   Flore (végétaux)\n        *   Micro-organismes\n    *   **Composantes Non Vivantes (Biotope) :**\n        *   Eau\n        *   Air\n        *   Sol et Roches\n        *   Lumière et Température (Climat)\n\n*   L'ensemble **Biotope + Biocénose** et leurs interactions forment un **ÉCOSYSTÈME**.\n\n*   La Terre présente une grande **diversité d'écosystèmes** (ex: forêt, désert, lac, océan...).",
        "ar": "#### تنوع الأوساط الطبيعية\n\n*   **الوسط الطبيعي** هو مكان للعيش له خصائصه الخاصة.\n*   يتكون من:\n    *   **مكونات حية (عشيرة إحيائية):**\n        *   وحيش (حيوانات)\n        *   نبيت (نباتات)\n        *   كائنات مجهرية\n    *   **مكونات غير حية (محيا):**\n        *   ماء\n        *   هواء\n        *   تربة وصخور\n        *   ضوء وحرارة (مناخ)\n\n*   مجموع **المحيا + العشيرة الإحيائية** وتفاعلاتهما يشكل **حميلة بيئية**.\n\n*   تتميز الأرض بوجود **تنوع كبير في الحمائل البيئية** (مثال: غابة، صحراء، بحيرة، محيط...).",
        "en": "#### Diversity of Natural Environments\n\n*   A **natural environment** is a place of life with its own characteristics.\n*   It is composed of:\n    *   **Living Components (Biocenosis):**\n        *   Fauna (animals)\n        *   Flora (plants)\n        *   Micro-organisms\n    *   **Non-Living Components (Biotope):**\n        *   Water\n        *   Air\n        *   Soil and Rocks\n        *   Light and Temperature (Climate)\n\n*   The combination of **Biotope + Biocenosis** and their interactions form an **ECOSYSTEM**.\n\n*   The Earth has a great **diversity of ecosystems** (e.g., forest, desert, lake, ocean...)."
      }
    },
    {
      "id": "s-act-1762292707759",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l2",
      "title": {
        "fr": "Bilan des activités",
        "ar": "خلاصة الأنشطة",
        "en": "Activities Summary"
      },
      "content": {
        "fr": "Au cours de cette séquence, une activité principale a été menée : l'observation directe ou indirecte d'un milieu naturel (forêt, jardin, étang).\n\n1.  **Inventaire** : Nous avons listé tous les éléments visibles à l'œil nu ou à la loupe.\n2.  **Tri et Classification** : Nous avons regroupé ces éléments en deux catégories distinctes en nous basant sur les caractéristiques de la vie (nutrition, respiration, reproduction).\n    *   Catégorie 1 : Les êtres vivants (animaux, végétaux).\n    *   Catégorie 2 : Les constituants non-vivants (minéraux comme l'eau, le sol, les roches).\n\nCette démarche nous a permis de comprendre concrètement que tout milieu naturel est un mélange de composantes vivantes et non-vivantes, et de poser les bases de la définition de la biocénose et du biotope.",
        "ar": "خلال هذه الحصة، تم إجراء نشاط رئيسي: الملاحظة المباشرة أو غير المباشرة لوسط طبيعي (غابة، حديقة، بركة).\n\n1.  **الجرد**: قمنا بوضع قائمة بجميع العناصر المرئية بالعين المجردة أو بالمكبرة.\n2.  **الفرز والتصنيف**: قمنا بتجميع هذه العناصر في فئتين متميزتين بناءً على خصائص الحياة (التغذية، التنفس، التكاثر).\n    *   الفئة 1: الكائنات الحية (حيوانات، نباتات).\n    *   الفئة 2: المكونات غير الحية (معدنية مثل الماء، التربة، الصخور).\n\nهذا المنهج سمح لنا أن نفهم بشكل ملموس أن أي وسط طبيعي هو خليط من مكونات حية وغير حية، ووضع أسس تعريف العشيرة الإحيائية (Biocénose) والمحيا (Biotope).",
        "en": "During this sequence, a main activity was conducted: the direct or indirect observation of a natural environment (forest, garden, pond).\n\n1.  **Inventory**: We listed all the elements visible to the naked eye or with a magnifying glass.\n2.  **Sorting and Classification**: We grouped these elements into two distinct categories based on the characteristics of life (nutrition, respiration, reproduction).\n    *   Category 1: Living beings (animals, plants).\n    *   Category 2: Non-living constituents (minerals like water, soil, rocks).\n\nThis approach allowed us to understand in a concrete way that every natural environment is a mixture of living and non-living components, and to lay the groundwork for defining biocenosis and biotope."
      }
    },
    {
      "id": "s-syn-1762292707760",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l2",
      "title": {
        "fr": "Schéma de synthèse",
        "ar": "خطاطة تركيبية",
        "en": "Synthesis Summary"
      },
      "content": {
        "fr": "**Milieu Naturel**\n|\n+--- **Composantes Vivantes (Biocénose)**\n|    |\n|    +-- **Animaux (Faune)**\n|    +-- **Végétaux (Flore)**\n|    +-- **Micro-organismes**\n|    *(Caractéristiques : Se nourrissent, respirent, se reproduisent)*\n|\n+--- **Composantes Non-Vivantes (Biotope)**\n     |\n     +-- **Eau**\n     +-- **Air**\n     +-- **Sol et Roches**\n     *(Caractéristiques : Éléments minéraux, inertes)*\n\n**Biocénose + Biotope = Écosystème**",
        "ar": "**الوسط الطبيعي**\n|\n+--- **مكونات حية (العشيرة الإحيائية)**\n|    |\n|    +-- **حيوانات (الوحيش)**\n|    +-- **نباتات (النبيت)**\n|    +-- **كائنات مجهرية**\n|    *(الخصائص: تتغذى، تتنفس، تتكاثر)*\n|\n+--- **مكونات غير حية (المحيا)**\n     |\n     +-- **الماء**\n     +-- **الهواء**\n     +-- **التربة والصخور**\n     *(الخصائص: عناصر معدنية، جامدة)*\n\n**العشيرة الإحيائية + المحيا = نظام بيئي**",
        "en": "**Natural Environment**\n|\n+--- **Living Components (Biocenosis)**\n|    |\n|    +-- **Animals (Fauna)**\n|    +-- **Plants (Flora)**\n|    +-- **Microorganisms**\n|    *(Characteristics: They feed, breathe, reproduce)*\n|\n+--- **Non-Living Components (Biotope)**\n     |\n     +-- **Water**\n     +-- **Air**\n     +-- **Soil and Rocks**\n     *(Characteristics: Mineral elements, inert)*\n\n**Biocenosis + Biotope = Ecosystem**"
      }
    }
  ]
}