{
  "id": "1ac",
  "name": {
    "fr": "1ère Année Collège",
    "ar": "الأولى إعدادي",
    "en": "1st Year Middle School"
  },
  "chapters": [
    {
      "id": "svt-1ac-c1",
      "title": {
        "fr": "Chapitre 1 : Observation des milieux naturels",
        "ar": "الفصل 1: ملاحظة الأوساط الطبيعية",
        "en": "Chapter 1: Observation of natural environments"
      }
    },
    {
      "id": "svt-1ac-c2",
      "title": {
        "fr": "Chapitre 2 : Respiration dans différents milieux",
        "ar": "الفصل 2: التنفس في أوساط مختلفة",
        "en": "Chapter 2: Respiration in different environments"
      }
    },
    {
      "id": "svt-1ac-c3",
      "title": {
        "fr": "Chapitre 3 : Alimentation chez les êtres vivants",
        "ar": "الفصل 3: التغذية عند الكائنات الحية",
        "en": "Chapter 3: Nutrition in living beings"
      }
    },
    {
      "id": "svt-1ac-c4",
      "title": {
        "fr": "Chapitre 4 : Relations alimentaires et flux de matière et d'énergie",
        "ar": "الفصل 4: العلاقات الغذائية وتدفق المادة والطاقة",
        "en": "Chapter 4: Food relationships and flow of matter and energy"
      }
    },
    {
      "id": "svt-1ac-c5",
      "title": {
        "fr": "Chapitre 5 : Classification des êtres vivants et les équilibres naturels",
        "ar": "الفصل 5: تصنيف الكائنات الحية والتوازنات الطبيعية",
        "en": "Chapter 5: Classification of living beings and natural balances"
      }
    }
  ],
  "lessons": [
    {
      "id": "svt-1ac-l1",
      "topicId": "svt-1ac-c1",
      "status": "verified",
      "title": {
        "fr": "Séquence 1 : Diversité des milieux naturels",
        "ar": "التسلسل 1: تنوع الأوساط الطبيعية",
        "en": "Sequence 1: Diversity of natural environments"
      },
      "content": {
        "fr": "# Séquence 1 : La Diversité des Milieux Naturels\n\n## Introduction : Qu'est-ce qu'un milieu naturel ?\n\nLorsque tu te promènes, tu peux voir une forêt, une plage, une rivière ou même un désert. Chacun de ces endroits est un **milieu naturel**.\n\nUn milieu naturel est un lieu précis dans la nature où vivent des êtres vivants (animaux, végétaux) et où l'on trouve des éléments non-vivants (eau, air, roches, sol). Tous ces éléments sont en interaction.\n\n**Problématique :** Pourquoi existe-t-il une si grande variété de paysages et de milieux naturels ? Quelles sont leurs caractéristiques ?\n\n---\n\n## I. Exploration de différents milieux naturels\n\nPour comprendre cette diversité, nous allons \"visiter\" virtuellement quelques milieux très différents que l'on trouve au Maroc.\n\n### A. Le Milieu Forestier : La Forêt de Maâmora\n\nLa forêt est un milieu riche en vie, caractérisé par la présence de nombreux arbres.\n![une forêt de chênes-lièges dense dans la région de Maâmora au Maroc, avec une lumière douce filtrant à travers le feuillage et de la mousse sur les troncs d'arbres](img_une_for_t_de_ch_nes_li_ges_dense_dans_la_r_gion_de_1762389000633.png)\n\n*   **Les composantes vivantes (La biocénose) :**\n    *   **Végétaux :** Des arbres hauts (chêne-liège, pin), des arbustes, des fougères, de la mousse et des champignons.\n    *   **Animaux :** Des insectes (fourmis, scarabées), des oiseaux (pic-vert, mésange), des mammifères (lièvre, sanglier, écureuil) et des reptiles.\n*   **Les composantes non-vivantes (Le biotope) :**\n    *   **Le sol :** Riche en humus (feuilles et bois en décomposition), ce qui le rend sombre et fertile.\n    *   **L'air :** Souvent humide.\n    *   **L'eau :** Présente dans le sol, les plantes et parfois sous forme de petits ruisseaux.\n    *   **La lumière :** Tamisée, car filtrée par les feuilles des arbres.\n\n### B. Le Milieu Aquatique : Le Lac Dayet Aoua\n\nUn milieu aquatique d'eau douce comme un lac est un monde totalement différent.\n![une vue panoramique du lac Dayet Aoua près d'Ifrane, avec des roseaux sur les berges et des oiseaux aquatiques nageant sur l'eau calme](img_une_vue_panoramique_du_lac_dayet_aoua_pr_s_d_ifran_1762389022840.png)\n\n*   **Les composantes vivantes (La biocénose) :**\n    *   **Végétaux :** Des plantes aquatiques comme les nénuphars et les roseaux, ainsi que des algues microscopiques (le plancton végétal).\n    *   **Animaux :** Des poissons (carpes), des amphibiens (grenouilles), des insectes (libellules), des oiseaux aquatiques (canards) et des organismes microscopiques (le plancton animal).\n*   **Les composantes non-vivantes (Le biotope) :**\n    *   **L'eau :** C'est l'élément principal. Sa température et sa clarté sont importantes.\n    *   **Le fond :** Constitué de vase, de sable et de roches.\n    *   **L'air :** L'oxygène dissous dans l'eau est vital pour les poissons.\n    *   **La lumière :** Pénètre dans l'eau mais diminue avec la profondeur.\n\n### C. Le Milieu Désertique : Les Dunes de Merzouga\n\nLe désert est un milieu extrême, caractérisé par une grande sécheresse.\n![des dunes de sable orangé à Merzouga au lever du soleil, avec des ombres marquées et un ciel clair, montrant un fennec au loin](img_des_dunes_de_sable_orang_merzouga_au_lever_du_sole_1762389029903.png)\n\n*   **Les composantes vivantes (La biocénose) :**\n    *   **Végétaux :** Rares et adaptés au manque d'eau, comme l'alfa ou certains acacias.\n    *   **Animaux :** Actifs surtout la nuit pour éviter la chaleur. On y trouve des scorpions, des vipères, des fennecs, des dromadaires.\n*   **Les composantes non-vivantes (Le biotope) :**\n    *   **Le sol :** Principalement du sable ou des roches.\n    *   **L'air :** Très sec.\n    *   **L'eau :** Extrêmement rare.\n    *   **La température :** Très élevée le jour et très basse la nuit.\n    *   **La lumière :** Très intense.\n\n---\n\n## II. Les Facteurs responsables de la diversité des milieux\n\nPourquoi une forêt et un désert sont-ils si différents ? Cela est dû aux conditions physiques et chimiques de chaque milieu.\n\n### A. Les Facteurs Climatiques\n\nLe climat est l'ensemble des conditions météorologiques sur une longue période.\n![une infographie simple avec 4 icônes : un thermomètre pour la température, une goutte de pluie pour les précipitations, un soleil pour la luminosité, et un nuage soufflant pour le vent](img_une_infographie_simple_avec_4_ic_nes_un_thermom_tr_1762389035182.png)\n\n*   **La température :** Influence les fonctions vitales des êtres vivants.\n*   **Les précipitations (pluie, neige) :** La quantité d'eau disponible est essentielle à la vie.\n*   **La luminosité :** L'énergie lumineuse est indispensable pour la photosynthèse des végétaux.\n*   **Le vent :** Peut dessécher le sol et les plantes, ou transporter des graines.\n\n### B. Les Facteurs Édaphiques (liés au sol)\n\nLa nature du sol a un impact direct sur la végétation, qui elle-même influence la présence des animaux.\n![une coupe transversale de deux types de sol côte à côte. À gauche, un sol forestier sombre, épais et riche en humus avec des racines. À droite, un sol désertique sableux, clair et sec.](img_une_coupe_transversale_de_deux_types_de_sol_c_te_c_1762389041032.png)\n\n*   **La composition :** Un sol peut être sableux, argileux, calcaire...\n*   **La structure :** Compact ou aéré, il retient plus ou moins l'eau.\n*   **La richesse en matière organique (humus) :** Un sol riche nourrit mieux les plantes.\n\n---\n\n## Bilan\n\n*   Un **milieu naturel** est un écosystème formé par un **biotope** (les caractéristiques non-vivantes) et une **biocénose** (les êtres vivants).\n*   Il existe une grande **diversité** de milieux naturels (forêts, lacs, déserts...).\n*   Cette diversité s'explique par la variation des **facteurs physico-chimiques**, principalement le climat (température, eau) et la nature du sol.\n*   Chaque être vivant est **adapté** aux conditions spécifiques de son milieu de vie.",
        "ar": "# الحصة 1 : تنوع الأوساط الطبيعية\n\n## مقدمة: ما هو الوسط الطبيعي؟\n\nعندما تتجول، يمكنك أن ترى غابة، شاطئًا، نهرًا أو حتى صحراء. كل من هذه الأماكن هو **وسط طبيعي**.\n\nالوسط الطبيعي هو مكان محدد في الطبيعة تعيش فيه كائنات حية (حيوانات، نباتات) وتوجد به عناصر غير حية (ماء، هواء، صخور، تربة). كل هذه العناصر تتفاعل فيما بينها.\n\n**إشكالية:** لماذا يوجد هذا التنوع الكبير في المناظر الطبيعية والأوساط الطبيعية؟ وما هي خصائصها؟\n\n---\n\n## I. استكشاف أوساط طبيعية مختلفة\n\nلفهم هذا التنوع، سنقوم \"بزيارة\" افتراضية لبعض الأوساط المختلفة جدًا التي نجدها في المغرب.\n\n### أ. الوسط الغابوي: غابة المعمورة\n\nالغابة وسط غني بالحياة، يتميز بوجود العديد من الأشجار.\n%%IMAGE_1%%\n\n*   **المكونات الحية (العشيرة الإحيائية):**\n    *   **النباتات:** أشجار عالية (بلوط الفلين، الصنوبر)، شجيرات، سراخس، طحالب وفطريات.\n    *   **الحيوانات:** حشرات (نمل، خنافس)، طيور (نقار الخشب، القرقف)، ثدييات (أرنب، خنزير بري، سنجاب) وزواحف.\n*   **المكونات غير الحية (المحيا):**\n    *   **التربة:** غنية بالدبال (أوراق وأخشاب متحللة)، مما يجعلها داكنة وخصبة.\n    *   **الهواء:** غالبًا ما يكون رطبًا.\n    *   **الماء:** موجود في التربة والنباتات وأحيانًا على شكل جداول مائية صغيرة.\n    *   **الضوء:** خافت، لأنه يمر عبر أوراق الأشجار.\n\n### ب. الوسط المائي: بحيرة ضاية عوا\n\nالوسط المائي العذب مثل البحيرة هو عالم مختلف تمامًا.\n%%IMAGE_2%%\n\n*   **المكونات الحية (العشيرة الإحيائية):**\n    *   **النباتات:** نباتات مائية مثل زنابق الماء والقصب، بالإضافة إلى طحالب مجهرية (العوالق النباتية).\n    *   **الحيوانات:** أسماك (الشبوط)، برمائيات (ضفادع)، حشرات (اليعسوب)، طيور مائية (البط) وكائنات مجهرية (العوالق الحيوانية).\n*   **المكونات غير الحية (المحيا):**\n    *   **الماء:** هو المكون الرئيسي. درجة حرارته وصفاؤه مهمان.\n    *   **القاع:** يتكون من طين ورمل وصخور.\n    *   **الهواء:** الأكسجين المذاب في الماء ضروري لحياة الأسماك.\n    *   **الضوء:** يخترق الماء لكنه يقل مع العمق.\n\n### ج. الوسط الصحراوي: كثبان مرزوكة\n\nالصحراء وسط قاسٍ، يتميز بالجفاف الشديد.\n%%IMAGE_3%%\n\n*   **المكونات الحية (العشيرة الإحيائية):**\n    *   **النباتات:** نادرة ومتكيفة مع نقص المياه، مثل الحلفاء وبعض أنواع السنط.\n    *   **الحيوانات:** تنشط بشكل خاص في الليل لتجنب الحرارة. نجد فيها العقارب، الأفاعي، الفنك، والجمال.\n*   **المكونات غير الحية (المحيا):**\n    *   **التربة:** تتكون أساسًا من رمال أو صخور.\n    *   **الهواء:** جاف جدًا.\n    *   **الماء:** نادر للغاية.\n    *   **درجة الحرارة:** مرتفعة جدًا نهارًا ومنخفضة جدًا ليلاً.\n    *   **الضوء:** شديد جدًا.\n\n---\n\n## II. العوامل المسؤولة عن تنوع الأوساط\n\nلماذا تختلف الغابة عن الصحراء إلى هذا الحد؟ يرجع ذلك إلى الظروف الفيزيائية والكيميائية لكل وسط.\n\n### أ. العوامل المناخية\n\nالمناخ هو مجموع الظروف الجوية على مدى فترة طويلة.\n%%IMAGE_4%%\n\n*   **درجة الحرارة:** تؤثر على الوظائف الحيوية للكائنات الحية.\n*   **التساقطات (مطر، ثلج):** كمية المياه المتاحة ضرورية للحياة.\n*   **الإضاءة:** الطاقة الضوئية لا غنى عنها لعملية التركيب الضوئي لدى النباتات.\n*   **الرياح:** يمكن أن تجفف التربة والنباتات، أو تنقل البذور.\n\n### ب. العوامل التربوية (المرتبطة بالتربة)\n\nطبيعة التربة لها تأثير مباشر على الغطاء النباتي، والذي بدوره يؤثر على وجود الحيوانات.\n%%IMAGE_5%%\n\n*   **التركيب:** يمكن أن تكون التربة رملية، طينية، كلسية...\n*   **البنية:** متماسكة أو مهواة، تحتفظ بالماء بدرجات متفاوتة.\n*   **الغنى بالمواد العضوية (الدبال):** التربة الغنية تغذي النباتات بشكل أفضل.\n\n---\n\n## خلاصة\n\n*   **الوسط الطبيعي** هو نظام بيئي يتكون من **محيا** (الخصائص غير الحية) و **عشيرة إحيائية** (الكائنات الحية).\n*   يوجد **تنوع** كبير في الأوساط الطبيعية (غابات، بحيرات، صحاري...).\n*   يفسر هذا التنوع باختلاف **العوامل الفيزيائية-الكيميائية**، وبشكل أساسي المناخ (الحرارة، الماء) وطبيعة التربة.\n*   كل كائن حي **متكيف** مع الظروف الخاصة بوسط عيشه.",
        "en": "# Sequence 1: The Diversity of Natural Environments\n\n## Introduction: What is a Natural Environment?\n\nWhen you take a walk, you might see a forest, a beach, a river, or even a desert. Each of these places is a **natural environment**.\n\nA natural environment is a specific place in nature where living beings (animals, plants) live and where we find non-living components (water, air, rocks, soil). All these elements interact with each other.\n\n**Problem:** Why is there such a wide variety of landscapes and natural environments? What are their characteristics?\n\n---\n\n## I. Exploring Different Natural Environments\n\nTo understand this diversity, we will take a virtual \"tour\" of some very different environments.\n\n### A. The Forest Environment\n\nA forest is an environment rich in life, characterized by the presence of many trees.\n%%IMAGE_1%%\n\n*   **Living Components (Biocenosis):**\n    *   **Plants:** Tall trees (oak, pine), shrubs, ferns, moss, and fungi.\n    *   **Animals:** Insects (ants, beetles), birds (woodpecker, titmouse), mammals (hare, wild boar, squirrel), and reptiles.\n*   **Non-living Components (Biotope):**\n    *   **Soil:** Rich in humus (decomposing leaves and wood), which makes it dark and fertile.\n    *   **Air:** Often humid.\n    *   **Water:** Present in the soil, plants, and sometimes as small streams.\n    *   **Light:** Dimmed, as it is filtered by the tree leaves.\n\n### B. The Aquatic Environment: Lake or Pond\n\nA freshwater aquatic environment like a lake is a completely different world.\n%%IMAGE_2%%\n\n*   **Living Components (Biocenosis):**\n    *   **Plants:** Aquatic plants like water lilies and reeds, as well as microscopic algae (phytoplankton).\n    *   **Animals:** Fish (carp, pike), amphibians (frogs), insects (dragonflies), aquatic birds (ducks), and microscopic organisms (zooplankton).\n*   **Non-living Components (Biotope):**\n    *   **Water:** This is the main component. Its temperature and clarity are important.\n    *   **The Bottom:** Made of mud, sand, and rocks.\n    *   **Air:** Oxygen dissolved in the water is vital for fish.\n    *   **Light:** Penetrates the water but decreases with depth.\n\n### C. The Desert Environment\n\nThe desert is an extreme environment, characterized by extreme dryness.\n%%IMAGE_3%%\n\n*   **Living Components (Biocenosis):**\n    *   **Plants:** Rare and adapted to the lack of water, such as alfa grass or certain acacia trees.\n    *   **Animals:** Mostly active at night to avoid the heat. We can find scorpions, vipers, fennec foxes, and camels.\n*   **Non-living Components (Biotope):**\n    *   **Soil:** Mostly sand or rocks.\n    *   **Air:** Very dry.\n    *   **Water:** Extremely rare.\n    *   **Temperature:** Very high during the day and very low at night.\n    *   **Light:** Very intense.\n\n---\n\n## II. The Factors Responsible for the Diversity of Environments\n\nWhy are a forest and a desert so different? This is due to the physical and chemical conditions of each environment.\n\n### A. Climatic Factors\n\nThe climate is the set of weather conditions over a long period.\n%%IMAGE_4%%\n\n*   **Temperature:** Influences the vital functions of living beings.\n*   **Precipitation (rain, snow):** The amount of available water is essential for life.\n*   **Light:** Light energy is essential for photosynthesis in plants.\n*   **Wind:** Can dry out the soil and plants, or carry seeds.\n\n### B. Edaphic Factors (related to the soil)\n\nThe nature of the soil has a direct impact on the vegetation, which in turn influences the presence of animals.\n%%IMAGE_5%%\n\n*   **Composition:** Soil can be sandy, clayey, chalky, etc.\n*   **Structure:** Compact or aerated, it retains water to varying degrees.\n*   **Richness in organic matter (humus):** Rich soil nourishes plants better.\n\n---\n\n## Summary\n\n*   A **natural environment** is an ecosystem formed by a **biotope** (the non-living characteristics) and a **biocenosis** (the living beings).\n*   There is a great **diversity** of natural environments (forests, lakes, deserts...).\n*   This diversity is explained by the variation of **physico-chemical factors**, mainly climate (temperature, water) and the nature of the soil.\n*   Each living being is **adapted** to the specific conditions of its living environment."
      },
      "backgroundImage": "img_background_1762388988442.png",
      "backgroundImageSuggestion": "A vibrant montage of different natural Moroccan environments: a lush cork oak forest, a serene mountain lake, vast golden desert dunes, and a rocky Atlantic coastline."
    },
    {
      "id": "svt-1ac-l2",
      "topicId": "svt-1ac-c1",
      "status": "verified",
      "title": {
        "fr": "Séquence 2 : Diversité des constituants des milieux naturels",
        "ar": "التسلسل 2: تنوع مكونات الأوساط الطبيعية",
        "en": "Sequence 2: Diversity of the components of natural environments"
      },
      "content": {
        "fr": "# Séquence 2 : Diversité des constituants des milieux naturels\n\n### Introduction\n\nNous avons appris à observer un milieu naturel. Mais de quoi est-il composé exactement ? Si nous regardons de plus près une forêt, un lac ou même un désert, nous verrons qu'ils sont constitués de différents éléments. Dans cette leçon, nous allons apprendre à distinguer les constituants vivants et les constituants non-vivants d'un milieu naturel.\n\n### I. Les composantes vivantes (La biocénose)\n\nLes composantes vivantes, ou **êtres vivants**, sont tous les organismes qui respirent, se nourrissent, grandissent, se reproduisent et meurent. On peut les classer en plusieurs catégories.\n\n**1. Les animaux :**\nCe sont les êtres vivants qui se déplacent pour chercher leur nourriture. Ils peuvent être grands comme un dromadaire ou tout petits comme un insecte.\n*Exemples :* le renard, le poisson, l'escargot, le papillon, l'oiseau.\n\n![Un collage de divers animaux marocains : un renard du désert, un macaque de Barbarie dans une forêt de cèdres, un dauphin dans l'océan Atlantique et un aigle.](img_un_collage_de_divers_animaux_marocains_un_renard_d_1763034497827.png)\n\n**2. Les végétaux :**\nCe sont les êtres vivants qui sont généralement fixés dans le sol et qui produisent leur propre nourriture grâce à la lumière du soleil (photosynthèse). Ils incluent les arbres, les herbes et les fleurs.\n*Exemples :* le cèdre de l'Atlas, l'arganier, le palmier dattier, les algues.\n\n![Une photo montrant la diversité de la flore marocaine : un arganier, un palmier dattier dans une oasis, et des fleurs sauvages dans les montagnes de l'Atlas.](img_une_photo_montrant_la_diversit_de_la_flore_marocai_1763034510707.png)\n\n**3. Les autres êtres vivants (micro-organismes) :**\nIl existe d'autres êtres vivants, souvent invisibles à l'œil nu, qui jouent un rôle très important. Ce sont les champignons (qui décomposent la matière morte) et les bactéries.\n*Exemples :* les champignons, les moisissures, les bactéries dans le sol.\n\n![Une illustration schématique et colorée montrant des bactéries, des champignons (comme un champignon de Paris) et des algues microscopiques vus au microscope.](img_une_illustration_sch_matique_et_color_e_montrant_d_1763034523986.png)\n\n> **Définition importante :** L'ensemble de tous les êtres vivants (animaux, végétaux, micro-organismes) qui vivent dans un même milieu est appelé la **biocénose**.\n\n![Un schéma simple et clair montrant un cercle intitulé 'Biocénose' contenant des icônes d'un animal, d'une plante et d'un champignon.](img_un_sch_ma_simple_et_clair_montrant_un_cercle_intit_1763034534909.png)\n\n### II. Les composantes non-vivantes (Le biotope)\n\nLes composantes non-vivantes, aussi appelées **constituants minéraux**, sont les éléments du milieu naturel qui ne sont pas vivants. Ils sont essentiels à la vie des êtres vivants.\n\n**1. L'eau :**\nElle peut être sous différentes formes : mer, rivière, lac, pluie, neige, humidité de l'air.\n\n![Un paysage montrant un lac de montagne au Maroc avec un ciel clair et de la pluie tombant au loin.](img_un_paysage_montrant_un_lac_de_montagne_au_maroc_av_1763034548021.png)\n\n**2. L'air :**\nC'est le gaz qui nous entoure, indispensable à la respiration (contenant de l'oxygène). Le vent est de l'air en mouvement.\n\n![Des éoliennes sur une colline venteuse au Maroc, avec des nuages se déplaçant rapidement dans le ciel pour illustrer le vent (l'air en mouvement).](img_des_oliennes_sur_une_colline_venteuse_au_maroc_ave_1763034555573.png)\n\n**3. Le sol et les roches :**\nLe sol est la couche supérieure de la Terre où poussent les plantes. Il est composé de sable, d'argile, d'humus... Sous le sol, on trouve les roches.\n\n![Une vue en coupe transversale du sol, montrant différentes couches : humus en haut, puis argile, sable et la roche mère en bas.](img_une_vue_en_coupe_transversale_du_sol_montrant_diff_1763034569421.png)\n\n> **Définition importante :** L'ensemble des composantes non-vivantes (eau, air, sol, roches) d'un milieu constitue le **biotope**. Le biotope est le lieu de vie de la biocénose.\n\n![Un schéma simple et clair montrant un cercle intitulé 'Biotope' contenant des icônes de gouttes d'eau, d'un nuage (air), et d'une pierre (sol/roche).](img_un_sch_ma_simple_et_clair_montrant_un_cercle_intit_1763034578645.png)\n\n### III. Notion d'écosystème\n\nDans un milieu naturel, les êtres vivants (biocénose) et les éléments non-vivants (biotope) ne sont pas séparés. Ils sont en interaction constante. Par exemple, les plantes (biocénose) puisent l'eau et les minéraux du sol (biotope), et les animaux (biocénose) respirent l'air (biotope).\n\nL'ensemble formé par la **biocénose** et le **biotope**, ainsi que les relations qui existent entre eux, est appelé un **écosystème**.\n\n**Écosystème = Biocénose (vivants) + Biotope (non-vivants)**\n\n![Un diagramme de Venn montrant deux cercles qui se chevauchent. Un cercle est 'Biocénose' (animaux, plantes), l'autre est 'Biotope' (eau, air, sol). La zone de chevauchement est intitulée 'Écosystème', avec des flèches montrant les interactions.](img_un_diagramme_de_venn_montrant_deux_cercles_qui_se__1763034609456.png)\n\n### Bilan de la séquence\n\n*   Un milieu naturel est composé de **constituants vivants** (animaux, végétaux, micro-organismes) qui forment la **biocénose**.\n*   Il est aussi composé de **constituants non-vivants** (eau, air, sol, roches) qui forment le **biotope**.\n*   L'ensemble de la biocénose et du biotope, et leurs interactions, forme un **écosystème**.",
        "ar": "# التسلسل 2: تنوع مكونات الأوساط الطبيعية\n\n### مقدمة\n\nلقد تعلمنا كيفية ملاحظة وسط طبيعي. ولكن مم يتكون بالضبط؟ إذا نظرنا عن كثب إلى غابة أو بحيرة أو حتى صحراء، سنرى أنها تتكون من عناصر مختلفة. في هذا الدرس، سنتعلم التمييز بين المكونات الحية والمكونات غير الحية لوسط طبيعي.\n\n### I. المكونات الحية (العشيرة الإحيائية)\n\nالمكونات الحية، أو **الكائنات الحية**، هي جميع الكائنات التي تتنفس، تتغذى، تنمو، تتكاثر وتموت. يمكن تصنيفها إلى عدة فئات.\n\n**1. الحيوانات:**\nهي الكائنات الحية التي تتحرك للبحث عن طعامها. يمكن أن تكون كبيرة كالجمل أو صغيرة جدًا كالحشرة.\n*أمثلة:* الثعلب، السمك، الحلزون، الفراشة، الطائر.\n\n%%IMAGE_1%%\n\n**2. النباتات:**\nهي الكائنات الحية التي تكون عادة مثبتة في التربة وتنتج غذاءها بنفسها بفضل ضوء الشمس (التركيب الضوئي). تشمل الأشجار والأعشاب والزهور.\n*أمثلة:* أرز الأطلس، شجرة الأركان، نخيل التمر، الطحالب.\n\n%%IMAGE_2%%\n\n**3. الكائنات الحية الأخرى (الكائنات المجهرية):**\nتوجد كائنات حية أخرى، غالبًا ما تكون غير مرئية بالعين المجردة، وتلعب دورًا مهمًا للغاية. وهي الفطريات (التي تحلل المواد الميتة) والبكتيريا.\n*أمثلة:* الفطر، العفن، البكتيريا في التربة.\n\n%%IMAGE_3%%\n\n> **تعريف مهم:** مجموع كل الكائنات الحية (الحيوانات، النباتات، الكائنات المجهرية) التي تعيش في نفس الوسط يسمى **العشيرة الإحيائية** (Biocénose).\n\n%%IMAGE_4%%\n\n### II. المكونات غير الحية (المَحْيَا)\n\nالمكونات غير الحية، وتسمى أيضًا **المكونات المعدنية**، هي عناصر الوسط الطبيعي غير الحية. وهي ضرورية لحياة الكائنات الحية.\n\n**1. الماء:**\nيمكن أن يكون بأشكال مختلفة: بحر، نهر، بحيرة، مطر، ثلج، رطوبة الهواء.\n\n%%IMAGE_5%%\n\n**2. الهواء:**\nهو الغاز الذي يحيط بنا، وهو ضروري للتنفس (يحتوي على الأكسجين). الرياح هي الهواء المتحرك.\n\n%%IMAGE_6%%\n\n**3. التربة والصخور:**\nالتربة هي الطبقة العليا من الأرض حيث تنمو النباتات. تتكون من الرمل والطين والدبال... تحت التربة، نجد الصخور.\n\n%%IMAGE_7%%\n\n> **تعريف مهم:** مجموع المكونات غير الحية (الماء، الهواء، التربة، الصخور) لوسط ما يشكل **المَحْيَا** (Biotope). المحيا هو مكان عيش العشيرة الإحيائية.\n\n%%IMAGE_8%%\n\n### III. مفهوم النظام البيئي\n\nفي وسط طبيعي، الكائنات الحية (العشيرة الإحيائية) والعناصر غير الحية (المحيا) ليست منفصلة. فهي في تفاعل مستمر. على سبيل المثال، تمتص النباتات (العشيرة الإحيائية) الماء والمعادن من التربة (المحيا)، وتتنفس الحيوانات (العشيرة الإحيائية) الهواء (المحيا).\n\nالمجموعة المكونة من **العشيرة الإحيائية** و**المحيا**، بالإضافة إلى العلاقات القائمة بينهما، تسمى **نظامًا بيئيًا** (Écosystème).\n\n**النظام البيئي = العشيرة الإحيائية (كائنات حية) + المحيا (مكونات غير حية)**\n\n%%IMAGE_9%%\n\n### خلاصة التسلسل\n\n*   يتكون الوسط الطبيعي من **مكونات حية** (حيوانات، نباتات، كائنات مجهرية) تشكل **العشيرة الإحيائية**.\n*   ويتكون أيضًا من **مكونات غير حية** (ماء، هواء، تربة، صخور) تشكل **المحيا**.\n*   مجموع العشيرة الإحيائية والمحيا، وتفاعلاتهما، يشكل **نظامًا بيئيًا**.",
        "en": "# Sequence 2: Diversity of the Components of Natural Environments\n\n### Introduction\n\nWe have learned how to observe a natural environment. But what is it exactly made of? If we look closely at a forest, a lake, or even a desert, we will see that they are made up of different elements. In this lesson, we will learn to distinguish between the living and non-living components of a natural environment.\n\n### I. Living Components (Biocenosis)\n\nLiving components, or **living beings**, are all organisms that breathe, feed, grow, reproduce, and die. They can be classified into several categories.\n\n**1. Animals:**\nThese are living beings that move to find their food. They can be large like a dromedary camel or very small like an insect.\n*Examples:* fox, fish, snail, butterfly, bird.\n\n%%IMAGE_1%%\n\n**2. Plants (Vegetation):**\nThese are living beings that are generally fixed in the soil and produce their own food using sunlight (photosynthesis). They include trees, grasses, and flowers.\n*Examples:* the Atlas cedar, the argan tree, the date palm, algae.\n\n%%IMAGE_2%%\n\n**3. Other Living Beings (Microorganisms):**\nThere are other living beings, often invisible to the naked eye, that play a very important role. These are fungi (which decompose dead matter) and bacteria.\n*Examples:* mushrooms, molds, bacteria in the soil.\n\n%%IMAGE_3%%\n\n> **Important Definition:** The entire set of all living beings (animals, plants, microorganisms) that live in the same environment is called the **biocenosis**.\n\n%%IMAGE_4%%\n\n### II. Non-Living Components (Biotope)\n\nNon-living components, also called **mineral constituents**, are the elements of the natural environment that are not alive. They are essential for the life of living beings.\n\n**1. Water:**\nIt can be in different forms: sea, river, lake, rain, snow, air humidity.\n\n%%IMAGE_5%%\n\n**2. Air:**\nIt is the gas that surrounds us, essential for breathing (containing oxygen). The wind is air in motion.\n\n%%IMAGE_6%%\n\n**3. Soil and Rocks:**\nSoil is the top layer of the Earth where plants grow. It is composed of sand, clay, humus... Beneath the soil, we find rocks.\n\n%%IMAGE_7%%\n\n> **Important Definition:** The entire set of non-living components (water, air, soil, rocks) of an environment constitutes the **biotope**. The biotope is the living place of the biocenosis.\n\n%%IMAGE_8%%\n\n### III. The Concept of an Ecosystem\n\nIn a natural environment, living beings (biocenosis) and non-living elements (biotope) are not separate. They are in constant interaction. For example, plants (biocenosis) draw water and minerals from the soil (biotope), and animals (biocenosis) breathe the air (biotope).\n\nThe ensemble formed by the **biocenosis** and the **biotope**, as well as the relationships that exist between them, is called an **ecosystem**.\n\n**Ecosystem = Biocenosis (living) + Biotope (non-living)**\n\n%%IMAGE_9%%\n\n### Sequence Summary\n\n*   A natural environment is composed of **living components** (animals, plants, microorganisms) which form the **biocenosis**.\n*   It is also composed of **non-living components** (water, air, soil, rocks) which form the **biotope**.\n*   The combination of the biocenosis and the biotope, and their interactions, forms an **ecosystem**."
      },
      "backgroundImage": "img_background_1763034482311.png",
      "backgroundImageSuggestion": "A vibrant panoramic view of a Moroccan national park, like Ifrane, showing cedar trees, a flowing river, rocks, and a Barbary macaque in the distance, under a clear blue sky."
    },
    {
      "id": "svt-1ac-l3",
      "topicId": "svt-1ac-c1",
      "status": "verified",
      "title": {
        "fr": "Séquence 3 : La cellule en tant qu'unité structurelle de l'être vivant",
        "ar": "التسلسل 3: الخلية كوحدة بنيوية للكائن الحي",
        "en": "Sequence 3: The cell as a structural unit of the living being"
      },
      "content": {
        "fr": "# Séquence 3 : La cellule, unité structurelle de l'être vivant\n\n### Introduction : De quoi sont faits les êtres vivants ?\n\nImagine une maison. Elle est construite à partir de briques. Toutes les briques, assemblées, forment les murs, puis la maison entière. Pour les êtres vivants, c'est un peu pareil ! Le corps d'un animal, d'une plante, ou même le nôtre, est constitué de milliards de minuscules \"briques\" appelées **cellules**.\n\nLa cellule est la plus petite unité de base de la vie. Pour les observer, car elles sont invisibles à l'œil nu, nous avons besoin d'un instrument spécial : le **microscope**.\n\n---\n\n### I. Observation de cellules végétales : l'exemple de l'oignon\n\nPour découvrir à quoi ressemble une cellule végétale, nous allons préparer une observation microscopique d'un petit morceau d'épiderme d'oignon (la fine peau entre les couches de l'oignon).\n\n**Activité : Préparation et observation**\n\n1.  **Préparation de la lame :** On prélève un petit fragment de la fine peau transparente d'un oignon. On le dépose sur une lame de verre avec une goutte d'eau (ou de colorant comme le bleu de méthylène pour mieux voir les détails). On recouvre délicatement avec une lamelle.\n    ![Schéma simple montrant la préparation d'une lame d'épiderme d'oignon étape par étape, avec lame, goutte d'eau, fragment de peau d'oignon et lamelle](img_sch_ma_simple_montrant_la_pr_paration_d_une_lame_d_1763053923093.png)\n\n2.  **Observation au microscope :** En observant la préparation au microscope, on voit de nombreuses petites structures de forme géométrique, bien rangées les unes contre les autres, comme un mur de briques.\n    ![Dessin d'observation réaliste de cellules d'épiderme d'oignon vues au microscope, avec des légendes claires pointant vers une seule cellule et ses voisines](img_dessin_d_observation_r_aliste_de_cellules_d_piderm_1763053915388.jpg)\n\n**Interprétation : La structure d'une cellule végétale**\n\nChaque \"brique\" est une cellule. En regardant de plus près, on peut distinguer plusieurs parties :\n\n*   **La paroi cellulaire :** C'est une enveloppe rigide qui donne à la cellule sa forme géométrique et la protège. Elle est propre aux végétaux.\n*   **La membrane cytoplasmique :** Juste sous la paroi, c'est une fine enveloppe qui contrôle ce qui entre et sort de la cellule.\n*   **Le cytoplasme :** Une substance gélatineuse qui remplit la cellule.\n*   **Le noyau :** Un petit élément, souvent rond, qui est le \"cerveau\" de la cellule. Il contient les informations pour le fonctionnement de la cellule.\n\n![Schéma détaillé et légendé d'une seule cellule végétale d'oignon, montrant clairement la paroi cellulaire épaisse, la membrane cytoplasmique fine, le cytoplasme et le noyau](img_sch_ma_d_taill_et_l_gend_d_une_seule_cellule_v_g_t_1763053876032.jpg)\n\n---\n\n### II. Observation de cellules animales : l'exemple des cellules buccales\n\nLes animaux sont-ils aussi faits de cellules ? Pour le vérifier, observons les cellules de l'intérieur de notre propre bouche.\n\n**Activité : Préparation et observation**\n\n1.  **Préparation de la lame :** On frotte doucement l'intérieur de sa joue avec un coton-tige, puis on l'étale sur une lame. On ajoute une goutte de colorant (bleu de méthylène) pour bien voir le noyau, et on recouvre d'une lamelle.\n    ![Schéma simple montrant la préparation d'une lame de cellules buccales, avec coton-tige, frottis sur la lame, goutte de colorant et lamelle](img_sch_ma_simple_montrant_la_pr_paration_d_une_lame_d_1763053822313.jpg)\n\n2.  **Observation au microscope :** On observe des cellules isolées ou en petits groupes. Elles ont une forme irrégulière et ne sont pas bien rangées comme les cellules d'oignon.\n    ![Dessin d'observation réaliste de plusieurs cellules de la muqueuse buccale vues au microscope, avec leurs formes irrégulières et un noyau bien visible au centre](img_dessin_d_observation_r_aliste_de_plusieurs_cellule_1763053808336.jpg)\n\n**Interprétation : La structure d'une cellule animale**\n\nDans une cellule animale, on retrouve des éléments communs avec la cellule végétale :\n\n*   **La membrane cytoplasmique :** C'est l'enveloppe extérieure de la cellule. Il n'y a **pas de paroi rigide** comme chez les végétaux.\n*   **Le cytoplasme :** La substance qui remplit la cellule.\n*   **Le noyau :** Le centre de contrôle de la cellule, bien visible grâce au colorant.\n\n![Schéma détaillé et légendé d'une seule cellule animale buccale, montrant la membrane cytoplasmique, le cytoplasme et le noyau central](img_sch_ma_d_taill_et_l_gend_d_une_seule_cellule_anima_1763053785419.jpg)\n\n---\n\n### III. Bilan et Conclusion : La Théorie Cellulaire\n\nEn comparant les deux observations, nous pouvons dresser un bilan.\n\n**Tableau Comparatif**\n\n| Caractéristique       | Cellule Végétale (Oignon) | Cellule Animale (Buccale) |\n|-----------------------|---------------------------|---------------------------|\n| **Forme**             | Géométrique, régulière    | Irrégulière, variable     |\n| **Paroi Cellulaire**  | **Présente** (rigide)     | **Absente**               |\n| **Membrane**          | Présente                  | Présente                  |\n| **Cytoplasme**        | Présent                   | Présent                   |\n| **Noyau**             | Présent                   | Présent                   |\n\n![Diagramme comparatif côte à côte d'une cellule végétale et d'une cellule animale, mettant en évidence avec des flèches les similitudes (membrane, cytoplasme, noyau) et les différences (paroi, forme)](img_diagramme_comparatif_c_te_c_te_d_une_cellule_v_g_t_1763053771532.png)\n\n**Conclusion Générale**\n\nTous les êtres vivants, qu'ils soient végétaux ou animaux, sont constitués d'au moins une cellule. La cellule possède toujours une membrane, un cytoplasme et un noyau (pour la plupart).\n\nC'est ce qu'on appelle la **théorie cellulaire** : **la cellule est l'unité de structure et de fonctionnement de tous les êtres vivants.**\n\nCertains êtres vivants sont formés d'une seule cellule (organismes unicellulaires, comme les bactéries), tandis que d'autres, comme nous ou un arbre, sont formés de milliards de cellules (organismes pluricellulaires).\n\n![Illustration simple et colorée montrant à gauche un organisme unicellulaire comme une paramécie, et à droite un organisme pluricellulaire comme un chat, avec une flèche pointant vers un zoom montrant ses cellules](img_illustration_simple_et_color_e_montrant_gauche_un__1763053763837.jpg)",
        "ar": "# التسلسل 3: الخلية، الوحدة البنيوية للكائن الحي\n\n### مقدمة: مم تتكون الكائنات الحية؟\n\nتخيل منزلاً. إنه مبني من الطوب. كل الطوب، عند تجميعه، يشكل الجدران، ثم المنزل بأكمله. بالنسبة للكائنات الحية، الأمر مشابه إلى حد ما! جسم حيوان، أو نبات، أو حتى جسمنا، يتكون من مليارات \"الطوبات\" الصغيرة جدًا التي تسمى **الخلايا**.\n\nالخلية هي أصغر وحدة أساسية للحياة. ولملاحظتها، لأنها غير مرئية بالعين المجردة، نحتاج إلى أداة خاصة: **المجهر**.\n\n---\n\n### I. ملاحظة الخلايا النباتية: مثال البصل\n\nلاكتشاف شكل الخلية النباتية، سنقوم بإعداد ملاحظة مجهرية لقطعة صغيرة من بشرة البصل (القشرة الرقيقة بين طبقات البصل).\n\n**نشاط: التحضير والملاحظة**\n\n1.  **تحضير الشريحة:** نأخذ جزءًا صغيرًا من القشرة الشفافة الرقيقة للبصل. نضعه على صفيحة زجاجية مع قطرة ماء (أو ملون مثل أزرق الميثيلين لرؤية التفاصيل بشكل أفضل). نغطيها برفق بصفيحة.\n    %%IMAGE_1%%\n\n2.  **الملاحظة بالمجهر:** عند ملاحظة التحضير بالمجهر، نرى العديد من البنيات الصغيرة ذات الشكل الهندسي، مصطفة جيدًا بجانب بعضها البعض، مثل جدار من الطوب.\n    %%IMAGE_2%%\n\n**تفسير: بنية الخلية النباتية**\n\nكل \"طوبة\" هي خلية. بالنظر عن كثب، يمكننا تمييز عدة أجزاء:\n\n*   **الجدار الهيكلي:** هو غلاف صلب يعطي الخلية شكلها الهندسي ويحميها. وهو خاص بالنباتات.\n*   **الغشاء السيتوبلازمي:** يقع مباشرة تحت الجدار، وهو غلاف رقيق يتحكم في ما يدخل ويخرج من الخلية.\n*   **السيتوبلازم:** مادة هلامية تملأ الخلية.\n*   **النواة:** عنصر صغير، غالبًا ما يكون مستديرًا، وهو \"عقل\" الخلية. يحتوي على المعلومات اللازمة لعمل الخلية.\n\n%%IMAGE_3%%\n\n---\n\n### II. ملاحظة الخلايا الحيوانية: مثال خلايا مخاطية الفم\n\nهل الحيوانات مكونة أيضًا من خلايا؟ للتحقق من ذلك، لنتفحص خلايا من داخل فمنا.\n\n**نشاط: التحضير والملاحظة**\n\n1.  **تحضير الشريحة:** نفرك بلطف داخل الخد بقطعة قطن، ثم ندهنها على شريحة. نضيف قطرة من الملون (أزرق الميثيلين) لرؤية النواة بوضوح، ونغطيها بصفيحة.\n    %%IMAGE_4%%\n\n2.  **الملاحظة بالمجهر:** نلاحظ خلايا معزولة أو في مجموعات صغيرة. لها شكل غير منتظم وليست مصطفة بدقة مثل خلايا البصل.\n    %%IMAGE_5%%\n\n**تفسير: بنية الخلية الحيوانية**\n\nفي الخلية الحيوانية، نجد عناصر مشتركة مع الخلية النباتية:\n\n*   **الغشاء السيتوبلازمي:** هو الغلاف الخارجي للخلية. **لا يوجد جدار صلب** كما هو الحال في النباتات.\n*   **السيتوبلازم:** المادة التي تملأ الخلية.\n*   **النواة:** مركز التحكم في الخلية، مرئي بوضوح بفضل الملون.\n\n%%IMAGE_6%%\n\n---\n\n### III. حصيلة واستنتاج: النظرية الخلوية\n\nبمقارنة الملاحظتين، يمكننا استخلاص حصيلة.\n\n**جدول مقارن**\n\n| الخاصية | الخلية النباتية (البصل) | الخلية الحيوانية (الفم) |\n|---|---|---|\n| **الشكل** | هندسي، منتظم | غير منتظم، متغير |\n| **الجدار الهيكلي** | **موجود** (صلب) | **غائب** |\n| **الغشاء** | موجود | موجود |\n| **السيتوبلازم** | موجود | موجود |\n| **النواة** | موجودة | موجودة |\n\n%%IMAGE_7%%\n\n**استنتاج عام**\n\nجميع الكائنات الحية، سواء كانت نباتية أو حيوانية، تتكون من خلية واحدة على الأقل. تحتوي الخلية دائمًا على غشاء وسيتوبلازم ونواة (في معظم الحالات).\n\nهذا ما يسمى بـ **النظرية الخلوية**: **الخلية هي وحدة البنية والوظيفة لجميع الكائنات الحية.**\n\nبعض الكائنات الحية تتكون من خلية واحدة فقط (كائنات وحيدة الخلية، مثل البكتيريا)، بينما البعض الآخر، مثلنا أو شجرة، يتكون من مليارات الخلايا (كائنات متعددة الخلايا).\n\n%%IMAGE_8%%",
        "en": "# Sequence 3: The Cell, the Structural Unit of Living Beings\n\n### Introduction: What Are Living Things Made Of?\n\nImagine a house. It's built from bricks. All the bricks, assembled together, form the walls, and then the entire house. For living things, it's quite similar! The body of an animal, a plant, or even our own, is made up of billions of tiny \"bricks\" called **cells**.\n\nThe cell is the smallest basic unit of life. To observe them, as they are invisible to the naked eye, we need a special instrument: the **microscope**.\n\n---\n\n### I. Observation of Plant Cells: The Onion Example\n\nTo discover what a plant cell looks like, we will prepare a microscopic observation of a small piece of onion epidermis (the thin skin between the layers of an onion).\n\n**Activity: Preparation and Observation**\n\n1.  **Slide Preparation:** A small fragment of the thin, transparent skin of an onion is taken. It is placed on a glass slide with a drop of water (or a stain like methylene blue to see details better). It is then gently covered with a coverslip.\n    %%IMAGE_1%%\n\n2.  **Microscope Observation:** When observing the preparation under the microscope, we see numerous small, geometrically shaped structures, neatly arranged next to each other, like a brick wall.\n    %%IMAGE_2%%\n\n**Interpretation: The Structure of a Plant Cell**\n\nEach \"brick\" is a cell. Looking closer, we can distinguish several parts:\n\n*   **The Cell Wall:** This is a rigid envelope that gives the cell its geometric shape and protects it. It is specific to plants.\n*   **The Cytoplasmic Membrane:** Just beneath the wall, it is a thin envelope that controls what enters and exits the cell.\n*   **The Cytoplasm:** A gel-like substance that fills the cell.\n*   **The Nucleus:** A small, often round element that is the \"brain\" of the cell. It contains the information for the cell's functioning.\n\n%%IMAGE_3%%\n\n---\n\n### II. Observation of Animal Cells: The Cheek Cell Example\n\nAre animals also made of cells? To verify this, let's observe the cells from the inside of our own mouths.\n\n**Activity: Preparation and Observation**\n\n1.  **Slide Preparation:** Gently rub the inside of your cheek with a cotton swab, then smear it onto a slide. Add a drop of stain (methylene blue) to see the nucleus clearly, and cover with a coverslip.\n    %%IMAGE_4%%\n\n2.  **Microscope Observation:** We observe isolated cells or small groups of them. They have an irregular shape and are not as neatly arranged as onion cells.\n    %%IMAGE_5%%\n\n**Interpretation: The Structure of an Animal Cell**\n\nIn an animal cell, we find elements common with the plant cell:\n\n*   **The Cytoplasmic Membrane:** This is the outer envelope of the cell. There is **no rigid wall** as in plants.\n*   **The Cytoplasm:** The substance that fills the cell.\n*   **The Nucleus:** The control center of the cell, clearly visible thanks to the stain.\n\n%%IMAGE_6%%\n\n---\n\n### III. Summary and Conclusion: The Cell Theory\n\nBy comparing the two observations, we can draw a conclusion.\n\n**Comparison Table**\n\n| Characteristic      | Plant Cell (Onion)       | Animal Cell (Cheek)       |\n|---------------------|---------------------------|---------------------------|\n| **Shape**           | Geometric, regular        | Irregular, variable       |\n| **Cell Wall**       | **Present** (rigid)       | **Absent**                |\n| **Membrane**        | Present                   | Present                   |\n| **Cytoplasm**       | Present                   | Present                   |\n| **Nucleus**         | Present                   | Present                   |\n\n%%IMAGE_7%%\n\n**General Conclusion**\n\nAll living beings, whether plants or animals, are made up of at least one cell. The cell always has a membrane, a cytoplasm, and a nucleus (for the most part).\n\nThis is known as the **Cell Theory**: **the cell is the unit of structure and function of all living beings.**\n\nSome living things are made of a single cell (unicellular organisms, like bacteria), while others, like us or a tree, are made of billions of cells (multicellular organisms).\n\n%%IMAGE_8%%"
      },
      "backgroundImage": "img_background_1763053624926.png",
      "backgroundImageSuggestion": "A vibrant, stylized background showing a mix of illustrated animal and plant cells, with a microscope silhouette in the corner."
    },
    {
      "id": "svt-1ac-l4",
      "topicId": "svt-1ac-c2",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 1 : Respiration chez certains êtres vivants",
        "ar": "التسلسل 1: التنفس عند بعض الكائنات الحية",
        "en": "Sequence 1: Respiration in certain living beings"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l5",
      "topicId": "svt-1ac-c2",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 2 : Adaptation de la respiration au milieu aérien chez les animaux",
        "ar": "التسلسل 2: تكيف التنفس مع الوسط الهوائي عند الحيوانات",
        "en": "Sequence 2: Adaptation of respiration to the aerial environment in animals"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l6",
      "topicId": "svt-1ac-c2",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 3 : Adaptation de la respiration des insectes et des plantes au milieu aérien",
        "ar": "التسلسل 3: تكيف تنفس الحشرات والنباتات مع الوسط الهوائي",
        "en": "Sequence 3: Adaptation of respiration in insects and plants to the aerial environment"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l7",
      "topicId": "svt-1ac-c2",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 4 : Adaptation de la respiration des êtres vivants au milieu aquatique",
        "ar": "التسلسل 4: تكيف تنفس الكائنات الحية مع الوسط المائي",
        "en": "Sequence 4: Adaptation of respiration of living beings to the aquatic environment"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l8",
      "topicId": "svt-1ac-c3",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 1 : Régime alimentaire omnivore chez l'Homme",
        "ar": "التسلسل 1: النظام الغذائي القارت عند الإنسان",
        "en": "Sequence 1: Omnivorous diet in humans"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l9",
      "topicId": "svt-1ac-c3",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 2 : Étude comparative de deux régimes alimentaires : herbivore et carnivore",
        "ar": "التسلسل 2: دراسة مقارنة لنظامين غذائيين: العاشب واللاحم",
        "en": "Sequence 2: Comparative study of two diets: herbivore and carnivore"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l10",
      "topicId": "svt-1ac-c3",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 3 : La nutrition chez les plantes",
        "ar": "التسلسل 3: التغذية عند النباتات",
        "en": "Sequence 3: Nutrition in plants"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l11",
      "topicId": "svt-1ac-c4",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 1 : Les chaînes et réseaux alimentaires",
        "ar": "التسلسل 1: السلاسل والشبكات الغذائية",
        "en": "Sequence 1: Food chains and webs"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l12",
      "topicId": "svt-1ac-c4",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 2 : La production de la matière et le flux d'énergie",
        "ar": "التسلسل 2: إنتاج المادة وتدفق الطاقة",
        "en": "Sequence 2: Production of matter and energy flow"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l13",
      "topicId": "svt-1ac-c5",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 1 : Classification des végétaux",
        "ar": "التسلسل 1: تصنيف النباتات",
        "en": "Sequence 1: Classification of plants"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l14",
      "topicId": "svt-1ac-c5",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 2 : Classification des animaux",
        "ar": "التسلسل 2: تصنيف الحيوانات",
        "en": "Sequence 2: Classification of animals"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    },
    {
      "id": "svt-1ac-l15",
      "topicId": "svt-1ac-c5",
      "status": "pending_review",
      "title": {
        "fr": "Séquence 3 : Les équilibres naturels",
        "ar": "التسلسل 3: التوازنات الطبيعية",
        "en": "Sequence 3: Natural balances"
      },
      "content": {
        "fr": "",
        "ar": "",
        "en": ""
      },
      "backgroundImage": ""
    }
  ],
  "exercises": [
    {
      "id": "e-1762387563151",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l1",
      "title": {
        "fr": "Définir les concepts clés",
        "ar": "تعريف المفاهيم الأساسية",
        "en": "Defining Key Concepts"
      },
      "content": {
        "fr": "Complète les phrases suivantes avec les mots de la liste : **milieu naturel, biocénose, biotope, écosystème, facteurs climatiques, facteurs édaphiques**.\n\n1.  Un lieu précis dans la nature, avec ses êtres vivants et ses éléments non-vivants, est un __________.\n2.  L'ensemble des êtres vivants (animaux, végétaux) d'un milieu s'appelle la __________.\n3.  L'ensemble des composantes non-vivantes (eau, air, sol, roches) d'un milieu constitue le __________.\n4.  La température et les précipitations sont des __________ qui influencent un milieu.\n5.  La nature du sol (sableux, argileux, riche en humus) correspond aux __________.\n6.  L'ensemble formé par le biotope et la biocénose est appelé un __________.",
        "ar": "أكمل الجمل التالية بالكلمات المناسبة من القائمة: **وسط طبيعي، العشيرة الإحيائية (biocénose)، المحيا (biotope)، نظام بيئي، عوامل مناخية، عوامل تربوية**.\n\n1.  مكان محدد في الطبيعة، بكائناته الحية وعناصره غير الحية، هو __________.\n2.  مجموع الكائنات الحية (حيوانات، نباتات) في وسط ما يسمى __________.\n3.  مجموع المكونات غير الحية (ماء، هواء، تربة، صخور) في وسط ما يشكل __________.\n4.  درجة الحرارة والتساقطات هي __________ تؤثر على الوسط.\n5.  طبيعة التربة (رملية، طينية، غنية بالدبال) تتوافق مع __________.\n6.  المجموعة التي تتكون من المحيا والعشيرة الإحيائية تسمى __________.",
        "en": "Complete the following sentences with words from the list: **natural environment, biocenosis, biotope, ecosystem, climatic factors, edaphic factors**.\n\n1.  A specific place in nature, with its living beings and non-living elements, is a __________.\n2.  All the living beings (animals, plants) in an environment are called the __________.\n3.  All the non-living components (water, air, soil, rocks) of an environment constitute the __________.\n4.  Temperature and precipitation are __________ that influence an environment.\n5.  The nature of the soil (sandy, clayey, rich in humus) corresponds to __________.\n6.  The whole formed by the biotope and the biocenosis is called an __________."
      },
      "solution": {
        "fr": "Voici les phrases complétées :\n\n1.  Un lieu précis dans la nature, avec ses êtres vivants et ses éléments non-vivants, est un **milieu naturel**.\n2.  L'ensemble des êtres vivants (animaux, végétaux) d'un milieu s'appelle la **biocénose**.\n3.  L'ensemble des composantes non-vivantes (eau, air, sol, roches) d'un milieu constitue le **biotope**.\n4.  La température et les précipitations sont des **facteurs climatiques** qui influencent un milieu.\n5.  La nature du sol (sableux, argileux, riche en humus) correspond aux **facteurs édaphiques**.\n6.  L'ensemble formé par le biotope et la biocénose est appelé un **écosystème**.",
        "ar": "إليك الجمل كاملة:\n\n1.  مكان محدد في الطبيعة، بكائناته الحية وعناصره غير الحية، هو **وسط طبيعي**.\n2.  مجموع الكائنات الحية (حيوانات، نباتات) في وسط ما يسمى **العشيرة الإحيائية (biocénose)**.\n3.  مجموع المكونات غير الحية (ماء، هواء، تربة، صخور) في وسط ما يشكل **المحيا (biotope)**.\n4.  درجة الحرارة والتساقطات هي **عوامل مناخية** تؤثر على الوسط.\n5.  طبيعة التربة (رملية، طينية، غنية بالدبال) تتوافق مع **العوامل التربوية**.\n6.  المجموعة التي تتكون من المحيا والعشيرة الإحيائية تسمى **نظام بيئي**.",
        "en": "Here are the completed sentences:\n\n1.  A specific place in nature, with its living beings and non-living elements, is a **natural environment**.\n2.  All the living beings (animals, plants) in an environment are called the **biocenosis**.\n3.  All the non-living components (water, air, soil, rocks) of an environment constitute the **biotope**.\n4.  Temperature and precipitation are **climatic factors** that influence an environment.\n5.  The nature of the soil (sandy, clayey, rich in humus) corresponds to **edaphic factors**.\n6.  The whole formed by the biotope and the biocenosis is called an **ecosystem**."
      }
    },
    {
      "id": "e-1762387563155",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l1",
      "title": {
        "fr": "Tableau Comparatif des Milieux",
        "ar": "جدول مقارنة الأوساط",
        "en": "Comparing Environments Table"
      },
      "content": {
        "fr": "Remplis le tableau suivant en te basant sur les informations de la leçon pour comparer les trois milieux naturels étudiés.\n\n![une infographie simple et colorée présentant un tableau vide avec trois colonnes intitulées 'Forêt de Maâmora', 'Lac Dayet Aoua', 'Dunes de Merzouga' et des icônes représentatives pour chaque milieu en en-tête](img_une_infographie_simple_et_color_e_pr_sentant_un_ta_1762389047928.png)\n\n| Caractéristique | Forêt de Maâmora | Lac Dayet Aoua | Dunes de Merzouga |\n| :--- | :--- | :--- | :--- |\n| **Composante non-vivante principale** | ? | ? | ? |\n| **Végétal typique** | ? | ? | ? |\n| **Animal typique** | ? | ? | ? |\n| **Condition climatique extrême** | ? (Humidité/Lumière) | ? (Lumière/Oxygène) | ? (Température/Eau) |",
        "ar": "املأ الجدول التالي بناءً على معلومات الدرس لمقارنة الأوساط الطبيعية الثلاثة المدروسة.\n\n%%IMAGE_1%%\n\n| الخاصية | غابة المعمورة | بحيرة ضاية عوا | كثبان مرزوكة |\n| :--- | :--- | :--- | :--- |\n| **المكون غير الحي الرئيسي** | ؟ | ؟ | ؟ |\n| **نبات مميز** | ؟ | ؟ | ؟ |\n| **حيوان مميز** | ؟ | ؟ | ؟ |\n| **ظرف مناخي قاسٍ** | ؟ (الرطوبة/الضوء) | ؟ (الضوء/الأكسجين) | ؟ (الحرارة/الماء) |",
        "en": "Fill in the following table based on the lesson's information to compare the three natural environments studied.\n\n%%IMAGE_1%%\n\n| Characteristic | Maâmora Forest | Dayet Aoua Lake | Merzouga Dunes |\n| :--- | :--- | :--- | :--- |\n| **Main non-living component** | ? | ? | ? |\n| **Typical plant** | ? | ? | ? |\n| **Typical animal** | ? | ? | ? |\n| **Extreme climatic condition** | ? (Humidity/Light) | ? (Light/Oxygen) | ? (Temperature/Water) |"
      },
      "solution": {
        "fr": "Voici le tableau complété avec les informations correctes :\n\n| Caractéristique | Forêt de Maâmora | Lac Dayet Aoua | Dunes de Merzouga |\n| :--- | :--- | :--- | :--- |\n| **Composante non-vivante principale** | Le sol riche en humus | L'eau | Le sable |\n| **Végétal typique** | Chêne-liège | Nénuphar / Roseau | Alfa / Acacia |\n| **Animal typique** | Sanglier / Pic-vert | Carpe / Grenouille | Fennec / Dromadaire |\n| **Condition climatique extrême** | Lumière tamisée | Diminution de la lumière en profondeur | Température très élevée / Manque d'eau |",
        "ar": "إليك الجدول مكتملاً بالمعلومات الصحيحة:\n\n| الخاصية | غابة المعمورة | بحيرة ضاية عوا | كثبان مرزوكة |\n| :--- | :--- | :--- | :--- |\n| **المكون غير الحي الرئيسي** | التربة الغنية بالدبال | الماء | الرمل |\n| **نبات مميز** | بلوط الفلين | زنبق الماء / القصب | الحلفاء / السنط |\n| **حيوان مميز** | الخنزير البري / نقار الخشب | الشبوط / الضفدع | الفنك / الجمل |\n| **ظرف مناخي قاسٍ** | ضوء خافت | تناقص الضوء في العمق | درجة حرارة جد مرتفعة / نقص الماء |",
        "en": "Here is the completed table with the correct information:\n\n| Characteristic | Maâmora Forest | Dayet Aoua Lake | Merzouga Dunes |\n| :--- | :--- | :--- | :--- |\n| **Main non-living component** | Soil rich in humus | Water | Sand |\n| **Typical plant** | Cork oak | Water lily / Reed | Alfa grass / Acacia |\n| **Typical animal** | Wild boar / Woodpecker | Carp / Frog | Fennec fox / Dromedary |\n| **Extreme climatic condition** | Dim light | Decreasing light with depth | Very high temperature / Lack of water |"
      }
    },
    {
      "id": "e-1762387563158",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l1",
      "title": {
        "fr": "Biotope ou Biocénose ?",
        "ar": "محيا أم عشيرة إحيائية؟",
        "en": "Biotope or Biocenosis?"
      },
      "content": {
        "fr": "Classe les éléments suivants dans la bonne colonne du tableau : *le sable, un chêne-liège, une grenouille, la température de l'air, l'humus du sol, un scorpion, l'eau d'un lac, une algue, le vent, un pin*.\n\n![une illustration de style dessin animé montrant divers éléments listés, comme un arbre, un scorpion, un thermomètre, un tas de sable, pour aider à la visualisation](img_une_illustration_de_style_dessin_anim_montrant_div_1762389052660.png)\n\n| Biotope (Composantes non-vivantes) | Biocénose (Composantes vivantes) |\n| :--- | :--- |\n| | |\n| | |\n| | |\n| | |\n| | |",
        "ar": "صنف العناصر التالية في الخانة المناسبة من الجدول: *الرمل، شجرة بلوط الفلين، ضفدع، درجة حرارة الهواء، دبال التربة، عقرب، ماء بحيرة، طحلب، الرياح، شجرة صنوبر*.\n\n%%IMAGE_1%%\n\n| المحيا (مكونات غير حية) | العشيرة الإحيائية (مكونات حية) |\n| :--- | :--- |\n| | |\n| | |\n| | |\n| | |\n| | |",
        "en": "Classify the following items into the correct column in the table: *sand, a cork oak tree, a frog, air temperature, soil humus, a scorpion, lake water, an alga, wind, a pine tree*.\n\n%%IMAGE_1%%\n\n| Biotope (Non-living components) | Biocenosis (Living components) |\n| :--- | :--- |\n| | |\n| | |\n| | |\n| | |\n| | |"
      },
      "solution": {
        "fr": "Voici le classement correct des éléments :\n\n| Biotope (Composantes non-vivantes) | Biocénose (Composantes vivantes) |\n| :--- | :--- |\n| le sable | un chêne-liège |\n| la température de l'air | une grenouille |\n| l'humus du sol | un scorpion |\n| l'eau d'un lac | une algue |\n| le vent | un pin |",
        "ar": "إليك التصنيف الصحيح للعناصر:\n\n| المحيا (مكونات غير حية) | العشيرة الإحيائية (مكونات حية) |\n| :--- | :--- |\n| الرمل | شجرة بلوط الفلين |\n| درجة حرارة الهواء | ضفدع |\n| دبال التربة | عقرب |\n| ماء بحيرة | طحلب |\n| الرياح | شجرة صنوبر |",
        "en": "Here is the correct classification of the items:\n\n| Biotope (Non-living components) | Biocenosis (Living components) |\n| :--- | :--- |\n| sand | a cork oak tree |\n| air temperature | a frog |\n| soil humus | a scorpion |\n| lake water | an alga |\n| wind | a pine tree |"
      }
    },
    {
      "id": "e-1762387563159",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l1",
      "title": {
        "fr": "Quel facteur est responsable ?",
        "ar": "ما هو العامل المسؤول؟",
        "en": "Which Factor is Responsible?"
      },
      "content": {
        "fr": "Pour chaque situation, identifie le principal facteur (climatique ou édaphique) responsable et explique brièvement pourquoi.\n\n1.  Dans le désert de Merzouga, les végétaux sont très rares et espacés.\n    *   **Facteur principal :** ?\n    *   **Explication :** ?\n\n2.  La végétation est abondante dans la forêt de Maâmora car le sol est sombre et fertile.\n    *   **Facteur principal :** ?\n    *   **Explication :** ?\n\n3.  Les poissons du lac Dayet Aoua ont besoin d'oxygène dissous dans l'eau pour respirer.\n    *   **Facteur principal :** ?\n    *   **Explication :** ?\n\n4.  En forêt, la lumière qui arrive au sol est faible, ce qui favorise la croissance de plantes comme les fougères qui n'ont pas besoin de beaucoup de soleil.\n    *   **Facteur principal :** ?\n    *   **Explication :** ?",
        "ar": "لكل حالة، حدد العامل الرئيسي (مناخي أو تربوي) المسؤول واشرح بإيجاز السبب.\n\n1.  في صحراء مرزوكة، النباتات نادرة جدًا ومتباعدة.\n    *   **العامل الرئيسي:** ؟\n    *   **الشرح:** ؟\n\n2.  الغطاء النباتي كثيف في غابة المعمورة لأن التربة داكنة وخصبة.\n    *   **العامل الرئيسي:** ؟\n    *   **الشرح:** ؟\n\n3.  تحتاج أسماك بحيرة ضاية عوا إلى الأكسجين المذاب في الماء للتنفس.\n    *   **العامل الرئيسي:** ؟\n    *   **الشرح:** ؟\n\n4.  في الغابة، الضوء الذي يصل إلى الأرض ضعيف، مما يساعد على نمو نباتات مثل السرخس التي لا تحتاج إلى الكثير من الشمس.\n    *   **العامل الرئيسي:** ؟\n    *   **الشرح:** ؟",
        "en": "For each situation, identify the main factor (climatic or edaphic) responsible and briefly explain why.\n\n1.  In the Merzouga desert, plants are very rare and spaced out.\n    *   **Main factor:** ?\n    *   **Explanation:** ?\n\n2.  Vegetation is abundant in the Maâmora forest because the soil is dark and fertile.\n    *   **Main factor:** ?\n    *   **Explanation:** ?\n\n3.  Fish in Dayet Aoua lake need dissolved oxygen in the water to breathe.\n    *   **Main factor:** ?\n    *   **Explanation:** ?\n\n4.  In the forest, the light that reaches the ground is dim, which favors the growth of plants like ferns that do not need much sun.\n    *   **Main factor:** ?\n    *   **Explanation:** ?"
      },
      "solution": {
        "fr": "Voici les réponses détaillées :\n\n1.  Dans le désert de Merzouga, les végétaux sont très rares et espacés.\n    *   **Facteur principal :** Les précipitations (facteur climatique).\n    *   **Explication :** L'eau est extrêmement rare dans le désert. Seules les plantes adaptées à la sécheresse peuvent survivre, et elles sont espacées pour ne pas se faire concurrence pour le peu d'eau disponible.\n\n2.  La végétation est abondante dans la forêt de Maâmora car le sol est sombre et fertile.\n    *   **Facteur principal :** La richesse du sol en humus (facteur édaphique).\n    *   **Explication :** L'humus, issu de la décomposition des feuilles et du bois, rend le sol très riche en nutriments, ce qui permet à de nombreuses plantes de pousser.\n\n3.  Les poissons du lac Dayet Aoua ont besoin d'oxygène dissous dans l'eau pour respirer.\n    *   **Facteur principal :** L'eau (composante du biotope).\n    *   **Explication :** La présence d'oxygène dissous est une caractéristique physico-chimique de l'eau essentielle à la vie des animaux aquatiques comme les poissons.\n\n4.  En forêt, la lumière qui arrive au sol est faible, ce qui favorise la croissance de plantes comme les fougères qui n'ont pas besoin de beaucoup de soleil.\n    *   **Facteur principal :** La luminosité (facteur climatique).\n    *   **Explication :** Le feuillage dense des arbres filtre la lumière du soleil. Les plantes qui vivent au sol doivent donc être adaptées à une faible luminosité.",
        "ar": "إليك الإجابات المفصلة:\n\n1.  في صحراء مرزوكة، النباتات نادرة جدًا ومتباعدة.\n    *   **العامل الرئيسي:** التساقطات (عامل مناخي).\n    *   **الشرح:** الماء نادر للغاية في الصحراء. فقط النباتات المتكيفة مع الجفاف يمكنها البقاء على قيد الحياة، وهي متباعدة حتى لا تتنافس على المياه القليلة المتاحة.\n\n2.  الغطاء النباتي كثيف في غابة المعمورة لأن التربة داكنة وخصبة.\n    *   **العامل الرئيسي:** غنى التربة بالدبال (عامل تربوي).\n    *   **الشرح:** الدبال، الناتج عن تحلل الأوراق والخشب، يجعل التربة غنية جدًا بالمواد المغذية، مما يسمح بنمو العديد من النباتات.\n\n3.  تحتاج أسماك بحيرة ضاية عوا إلى الأكسجين المذاب في الماء للتنفس.\n    *   **العامل الرئيسي:** الماء (مكون من المحيا).\n    *   **الشرح:** وجود الأكسجين المذاب هو خاصية فيزيائية-كيميائية للماء ضرورية لحياة الحيوانات المائية مثل الأسماك.\n\n4.  في الغابة، الضوء الذي يصل إلى الأرض ضعيف، مما يساعد على نمو نباتات مثل السرخس التي لا تحتاج إلى الكثير من الشمس.\n    *   **العامل الرئيسي:** الإضاءة (عامل مناخي).\n    *   **الشرح:** أوراق الشجر الكثيفة ترشح ضوء الشمس. لذلك، يجب أن تكون النباتات التي تعيش على الأرض متكيفة مع الإضاءة المنخفضة.",
        "en": "Here are the detailed answers:\n\n1.  In the Merzouga desert, plants are very rare and spaced out.\n    *   **Main factor:** Precipitation (climatic factor).\n    *   **Explanation:** Water is extremely scarce in the desert. Only plants adapted to drought can survive, and they are spaced out so as not to compete for the little available water.\n\n2.  Vegetation is abundant in the Maâmora forest because the soil is dark and fertile.\n    *   **Main factor:** The soil's richness in humus (edaphic factor).\n    *   **Explanation:** Humus, resulting from the decomposition of leaves and wood, makes the soil very rich in nutrients, which allows many plants to grow.\n\n3.  Fish in Dayet Aoua lake need dissolved oxygen in the water to breathe.\n    *   **Main factor:** Water (component of the biotope).\n    *   **Explanation:** The presence of dissolved oxygen is a physicochemical characteristic of water that is essential for the life of aquatic animals like fish.\n\n4.  In the forest, the light that reaches the ground is dim, which favors the growth of plants like ferns that do not need much sun.\n    *   **Main factor:** Luminosity (climatic factor).\n    *   **Explanation:** The dense foliage of the trees filters the sunlight. Therefore, plants living on the ground must be adapted to low light."
      }
    },
    {
      "id": "e-1762387563160",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l1",
      "title": {
        "fr": "Étude de cas : L'adaptation du fennec",
        "ar": "دراسة حالة: تكيف الفنك",
        "en": "Case Study: The Fennec Fox's Adaptation"
      },
      "content": {
        "fr": "Le fennec est un petit renard qui vit dans le désert de Merzouga. Il passe ses journées à l'abri dans un terrier et ne sort que la nuit pour chasser. Il possède de très grandes oreilles par rapport à sa taille.\n\n![une photo réaliste et détaillée d'un fennec dans les dunes de sable au crépuscule, ses grandes oreilles bien visibles](img_une_photo_r_aliste_et_d_taill_e_d_un_fennec_dans_l_1762389056832.png)\n\nEn te basant sur la leçon et ta logique, réponds aux questions suivantes :\n\n1.  Pourquoi le fennec est-il un animal nocturne (actif la nuit) ? À quel facteur climatique du désert cette adaptation répond-elle ?\n2.  À ton avis, quel est le rôle de ses grandes oreilles pour survivre dans un climat aussi chaud ?",
        "ar": "الفنك هو ثعلب صغير يعيش في صحراء مرزوكة. يقضي أيامه مختبئًا في جحر ولا يخرج إلا ليلاً للصيد. يمتلك أذنين كبيرتين جدًا مقارنة بحجمه.\n\n%%IMAGE_1%%\n\nبناءً على الدرس ومنطقك، أجب عن الأسئلة التالية:\n\n1.  لماذا يعتبر الفنك حيوانًا ليليًا (ينشط في الليل)؟ لأي عامل مناخي صحراوي يستجيب هذا التكيف؟\n2.  في رأيك، ما هو دور أذنيه الكبيرتين في البقاء على قيد الحياة في مناخ حار كهذا؟",
        "en": "The fennec fox is a small fox that lives in the Merzouga desert. It spends its days sheltered in a burrow and only comes out at night to hunt. It has very large ears relative to its size.\n\n%%IMAGE_1%%\n\nBased on the lesson and your logic, answer the following questions:\n\n1.  Why is the fennec fox a nocturnal animal (active at night)? To which climatic factor of the desert does this adaptation respond?\n2.  In your opinion, what is the role of its large ears in surviving in such a hot climate?"
      },
      "solution": {
        "fr": "Voici les solutions basées sur l'analyse des adaptations du fennec :\n\n1.  Le fennec est un animal nocturne pour **éviter les chaleurs extrêmes de la journée** dans le désert. C'est une adaptation au facteur climatique de la **température**, qui est très élevée le jour.\n2.  Ses grandes oreilles, riches en vaisseaux sanguins, agissent comme des radiateurs. Le sang qui y circule se refroidit au contact de l'air, ce qui aide le fennec à **évacuer la chaleur de son corps** et à réguler sa température. C'est donc aussi une adaptation à la **température élevée**.",
        "ar": "إليك الحلول المستندة إلى تحليل تكيفات الفنك:\n\n1.  الفنك حيوان ليلي **لتجنب حرارة النهار الشديدة** في الصحراء. هذا تكيف مع العامل المناخي المتمثل في **درجة الحرارة**، والتي تكون مرتفعة جدًا خلال النهار.\n2.  تعمل أذناه الكبيرتان، الغنيتان بالأوعية الدموية، مثل المبردات (رادياتور). يبرد الدم الذي يمر عبرها عند ملامسة الهواء، مما يساعد الفنك على **التخلص من حرارة جسمه** وتنظيم درجة حرارته. وبالتالي، فهو أيضًا تكيف مع **درجة الحرارة المرتفعة**.",
        "en": "Here are the solutions based on the analysis of the fennec fox's adaptations:\n\n1.  The fennec fox is a nocturnal animal to **avoid the extreme heat of the day** in the desert. This is an adaptation to the climatic factor of **temperature**, which is very high during the day.\n2.  Its large ears, rich in blood vessels, act like radiators. The blood circulating through them cools down when it comes into contact with the air, which helps the fennec fox to **release body heat** and regulate its temperature. It is therefore also an adaptation to the **high temperature**."
      }
    },
    {
      "id": "e-1763031303369",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l2",
      "title": {
        "fr": "Exercice 1 : Vrai ou Faux",
        "ar": "تمرين 1: صحيح أم خطأ",
        "en": "Exercise 1: True or False"
      },
      "content": {
        "fr": "Répondez par \"Vrai\" ou \"Faux\" aux affirmations suivantes :\n1. L'ensemble des êtres vivants d'un milieu s'appelle le biotope.\n2. L'eau, l'air et le sol sont des composantes vivantes.\n3. Un écosystème est formé par la biocénose et le biotope.\n4. Les plantes sont des êtres vivants qui produisent leur propre nourriture.\n5. Les champignons sont des constituants non-vivants.",
        "ar": "أجب بـ \"صحيح\" أو \"خطأ\" على العبارات التالية:\n1. مجموع الكائنات الحية في وسط ما يسمى المحيا (biotope).\n2. الماء والهواء والتربة هي مكونات حية.\n3. يتكون النظام البيئي من الأُحْيُومة (biocenosis) والمحيا (biotope).\n4. النباتات هي كائنات حية تنتج غذاءها بنفسها.\n5. الفطريات هي مكونات غير حية.",
        "en": "Answer \"True\" or \"False\" to the following statements:\n1. The set of all living things in an environment is called the biotope.\n2. Water, air, and soil are living components.\n3. An ecosystem is formed by the biocenosis and the biotope.\n4. Plants are living things that produce their own food.\n5. Fungi are non-living components."
      },
      "solution": {
        "fr": "1. Faux. L'ensemble des êtres vivants s'appelle la biocénose.\n2. Faux. Ce sont des composantes non-vivantes (le biotope).\n3. Vrai.\n4. Vrai.\n5. Faux. Les champignons sont des êtres vivants (micro-organismes).",
        "ar": "1. خطأ. مجموع الكائنات الحية يسمى الأُحْيُومة (biocenosis).\n2. خطأ. هي مكونات غير حية (المحيا - biotope).\n3. صحيح.\n4. صحيح.\n5. خطأ. الفطريات هي كائنات حية (كائنات مجهرية).",
        "en": "1. False. The set of all living things is called the biocenosis.\n2. False. They are non-living components (the biotope).\n3. True.\n4. True.\n5. False. Fungi are living things (micro-organisms)."
      }
    },
    {
      "id": "e-1763031303371",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l2",
      "title": {
        "fr": "Exercice 2 : Classer les Composantes",
        "ar": "تمرين 2: تصنيف المكونات",
        "en": "Exercise 2: Classify the Components"
      },
      "content": {
        "fr": "Observez l'image et la liste ci-dessous. Classez chaque élément dans le tableau en deux colonnes : \"Composantes vivantes (Biocénose)\" et \"Composantes non-vivantes (Biotope)\".\n\n![Un paysage de forêt de montagne marocaine avec un ruisseau, des rochers, des cèdres, un renard, et des champignons sur un tronc d'arbre.](img_un_paysage_de_for_t_de_montagne_marocaine_avec_un__1763034627468.png)\n\n**Liste des éléments :** Cèdre de l'Atlas, Eau du ruisseau, Rocher, Air, Renard, Champignon, Sol.",
        "ar": "لاحظ الصورة والقائمة أدناه. صنف كل عنصر في الجدول إلى عمودين: \"المكونات الحية (الأُحْيُومة)\" و \"المكونات غير الحية (المحيا)\".\n\n%%IMAGE_1%%\n\n**قائمة العناصر:** أرز الأطلس، ماء الجدول، صخرة، هواء، ثعلب، فطر، تربة.",
        "en": "Observe the image and the list below. Classify each element in the table into two columns: \"Living Components (Biocenosis)\" and \"Non-living Components (Biotope)\".\n\n%%IMAGE_1%%\n\n**List of elements:** Atlas Cedar, Stream water, Rock, Air, Fox, Mushroom, Soil."
      },
      "solution": {
        "fr": "Voici le classement correct :\n\n| Composantes vivantes (Biocénose) | Composantes non-vivantes (Biotope) |\n|---|---|\n| Cèdre de l'Atlas | Eau du ruisseau |\n| Renard | Rocher |\n| Champignon | Air |\n| | Sol |",
        "ar": "إليك التصنيف الصحيح:\n\n| المكونات الحية (الأُحْيُومة) | المكونات غير الحية (المحيا) |\n|---|---|\n| أرز الأطلس | ماء الجدول |\n| ثعلب | صخرة |\n| فطر | هواء |\n| | تربة |",
        "en": "Here is the correct classification:\n\n| Living Components (Biocenosis) | Non-living Components (Biotope) |\n|---|---|\n| Atlas Cedar | Stream water |\n| Fox | Rock |\n| Mushroom | Air |\n| | Soil |"
      }
    },
    {
      "id": "e-1763031303375",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l2",
      "title": {
        "fr": "Exercice 3 : Texte à Trous",
        "ar": "تمرين 3: املأ الفراغ",
        "en": "Exercise 3: Fill in the Blanks"
      },
      "content": {
        "fr": "Complétez le texte suivant avec les mots de la liste : **biocénose, écosystème, non-vivants, biotope, vivants**.\n\nUn milieu naturel est composé d'éléments ............ (animaux, végétaux...) qui forment la ............ . Il est aussi composé d'éléments ............ (eau, air, sol) qui forment le ............ . L'ensemble de ces deux composantes et leurs interactions constitue un ............ .",
        "ar": "أكمل النص التالي بالكلمات من القائمة: **الأُحْيُومة (biocenosis)، النظام البيئي، غير الحية، المحيا (biotope)، الحية**.\n\nيتكون الوسط الطبيعي من عناصر ............ (حيوانات، نباتات...) التي تشكل ............ . كما يتكون من عناصر ............ (ماء، هواء، تربة) التي تشكل ............ . ومجموع هذين المكونين وتفاعلاتهما يشكل ............ .",
        "en": "Complete the following text with words from the list: **biocenosis, ecosystem, non-living, biotope, living**.\n\nA natural environment is composed of ............ elements (animals, plants...) which form the ............ . It is also composed of ............ elements (water, air, soil) which form the ............ . The combination of these two components and their interactions constitutes an ............ ."
      },
      "solution": {
        "fr": "Un milieu naturel est composé d'éléments **vivants** (animaux, végétaux...) qui forment la **biocénose**. Il est aussi composé d'éléments **non-vivants** (eau, air, sol) qui forment le **biotope**. L'ensemble de ces deux composantes et leurs interactions constitue un **écosystème**.",
        "ar": "يتكون الوسط الطبيعي من عناصر **حية** (حيوانات، نباتات...) التي تشكل **الأُحْيُومة (biocenosis)**. كما يتكون من عناصر **غير الحية** (ماء، هواء، تربة) التي تشكل **المحيا (biotope)**. ومجموع هذين المكونين وتفاعلاتهما يشكل **نظامًا بيئيًا**.",
        "en": "A natural environment is composed of **living** elements (animals, plants...) which form the **biocenosis**. It is also composed of **non-living** elements (water, air, soil) which form the **biotope**. The combination of these two components and their interactions constitutes an **ecosystem**."
      }
    },
    {
      "id": "e-1763031303376",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l2",
      "title": {
        "fr": "Exercice 4 : Relier les Définitions",
        "ar": "تمرين 4: صل بسهم",
        "en": "Exercise 4: Match the Definitions"
      },
      "content": {
        "fr": "Reliez chaque terme à sa définition correcte :\n\n**Termes :**\n1. Biocénose\n2. Biotope\n3. Écosystème\n\n**Définitions :**\nA) L'ensemble des composantes non-vivantes d'un milieu (eau, air, sol).\nB) L'ensemble formé par la biocénose, le biotope et leurs interactions.\nC) L'ensemble de tous les êtres vivants d'un milieu (animaux, végétaux, micro-organismes).",
        "ar": "صل كل مصطلح بتعريفه الصحيح:\n\n**المصطلحات:**\n1. الأُحْيُومة (Biocenosis)\n2. المحيا (Biotope)\n3. النظام البيئي (Ecosystem)\n\n**التعاريف:**\nأ) مجموع المكونات غير الحية لوسط ما (ماء، هواء، تربة).\nب) المجموعة المكونة من الأُحْيُومة والمحيا وتفاعلاتهما.\nج) مجموع كل الكائنات الحية في وسط ما (حيوانات، نباتات، كائنات مجهرية).",
        "en": "Match each term with its correct definition:\n\n**Terms:**\n1. Biocenosis\n2. Biotope\n3. Ecosystem\n\n**Definitions:**\nA) The set of non-living components of an environment (water, air, soil).\nB) The entity formed by the biocenosis, the biotope, and their interactions.\nC) The set of all living things in an environment (animals, plants, micro-organisms)."
      },
      "solution": {
        "fr": "Les correspondances correctes sont :\n1. **Biocénose** → C) L'ensemble de tous les êtres vivants d'un milieu (animaux, végétaux, micro-organismes).\n2. **Biotope** → A) L'ensemble des composantes non-vivantes d'un milieu (eau, air, sol).\n3. **Écosystème** → B) L'ensemble formé par la biocénose, le biotope et leurs interactions.",
        "ar": "التطابقات الصحيحة هي:\n1. **الأُحْيُومة (Biocenosis)** ← ج) مجموع كل الكائنات الحية في وسط ما (حيوانات، نباتات، كائنات مجهرية).\n2. **المحيا (Biotope)** ← أ) مجموع المكونات غير الحية لوسط ما (ماء، هواء، تربة).\n3. **النظام البيئي (Ecosystem)** ← ب) المجموعة المكونة من الأُحْيُومة والمحيا وتفاعلاتهما.",
        "en": "The correct matches are:\n1. **Biocenosis** → C) The set of all living things in an environment (animals, plants, micro-organisms).\n2. **Biotope** → A) The set of non-living components of an environment (water, air, soil).\n3. **Ecosystem** → B) The entity formed by the biocenosis, the biotope, and their interactions."
      }
    },
    {
      "id": "e-1763031303378",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l2",
      "title": {
        "fr": "Exercice 5 : Analyse d'un Milieu Naturel",
        "ar": "تمرين 5: تحليل وسط طبيعي",
        "en": "Exercise 5: Analysis of a Natural Environment"
      },
      "content": {
        "fr": "Observez l'image d'une oasis.\n\n![Une oasis luxuriante dans le désert marocain, avec des palmiers dattiers, un petit point d'eau, du sable, et quelques dromadaires qui boivent.](img_une_oasis_luxuriante_dans_le_d_sert_marocain_avec__1763034636199.png)\n\n1. Identifiez deux composantes vivantes (biocénose) présentes dans cette oasis.\n2. Identifiez deux composantes non-vivantes (biotope) présentes dans cette oasis.\n3. Expliquez brièvement pourquoi une oasis est considérée comme un écosystème.",
        "ar": "لاحظ صورة الواحة.\n\n%%IMAGE_2%%\n\n1. حدد مكونين حيين (الأُحْيُومة) موجودين في هذه الواحة.\n2. حدد مكونين غير حيين (المحيا) موجودين في هذه الواحة.\n3. اشرح باختصار لماذا تعتبر الواحة نظامًا بيئيًا.",
        "en": "Observe the image of an oasis.\n\n%%IMAGE_2%%\n\n1. Identify two living components (biocenosis) present in this oasis.\n2. Identify two non-living components (biotope) present in this oasis.\n3. Briefly explain why an oasis is considered an ecosystem."
      },
      "solution": {
        "fr": "1. **Composantes vivantes :** Palmier dattier, dromadaire. (On peut aussi accepter : herbes, insectes, micro-organismes dans l'eau ou le sol).\n2. **Composantes non-vivantes :** Eau du point d'eau, sable (sol), air, roches.\n3. **Explication :** Une oasis est un écosystème car elle est composée d'êtres vivants (la biocénose : palmiers, dromadaires...) et d'éléments non-vivants (le biotope : eau, sable, air...). Ces éléments sont en interaction constante : les dromadaires boivent l'eau, les palmiers puisent l'eau du sol, et tous les êtres vivants respirent l'air.",
        "ar": "1. **مكونات حية:** نخيل التمر، الجمل. (يمكن قبول أيضًا: أعشاب، حشرات، كائنات دقيقة في الماء أو التربة).\n2. **مكونات غير حية:** ماء العين، الرمل (التربة)، الهواء، الصخور.\n3. **الشرح:** تعتبر الواحة نظامًا بيئيًا لأنها تتكون من كائنات حية (الأُحْيُومة: النخيل، الجمال...) وعناصر غير حية (المحيا: الماء، الرمل، الهواء...). هذه العناصر في تفاعل مستمر: الجمال تشرب الماء، والنخيل يمتص الماء من التربة، وجميع الكائنات الحية تتنفس الهواء.",
        "en": "1. **Living components:** Date palm, dromedary camel. (Also acceptable: grasses, insects, micro-organisms in the water or soil).\n2. **Non-living components:** Water from the pool, sand (soil), air, rocks.\n3. **Explanation:** An oasis is an ecosystem because it is composed of living things (the biocenosis: palm trees, camels...) and non-living elements (the biotope: water, sand, air...). These elements are in constant interaction: the camels drink the water, the palm trees draw water from the soil, and all living things breathe the air."
      }
    },
    {
      "id": "e-1763037175136",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l3",
      "title": {
        "fr": "Testez vos connaissances : Les concepts clés",
        "ar": "اختبر معلوماتك: المفاهيم الأساسية",
        "en": "Test Your Knowledge: Key Concepts"
      },
      "content": {
        "fr": "Choisissez la bonne réponse pour chaque question.\n\n1. La plus petite unité de base de la vie est :\n   a) Le microscope\n   b) La cellule\n   c) Le noyau\n\n2. Quel instrument est nécessaire pour observer les cellules ?\n   a) Une loupe\n   b) Des lunettes\n   c) Un microscope\n\n3. Quelle est la principale différence entre une cellule végétale et une cellule animale ?\n   a) La présence d'un noyau\n   b) La présence de cytoplasme\n   c) La présence d'une paroi cellulaire rigide chez la cellule végétale\n\n4. Le 'cerveau' de la cellule, qui contient les informations pour son fonctionnement, est :\n   a) Le cytoplasme\n   b) La membrane\n   c) Le noyau",
        "ar": "اختر الإجابة الصحيحة لكل سؤال.\n\n1. أصغر وحدة أساسية للحياة هي:\n   أ) المجهر\n   ب) الخلية\n   ج) النواة\n\n2. ما هي الأداة اللازمة لملاحظة الخلايا؟\n   أ) عدسة مكبرة\n   ب) نظارات\n   ج) مجهر\n\n3. ما هو الفرق الرئيسي بين الخلية النباتية والخلية الحيوانية؟\n   أ) وجود نواة\n   ب) وجود السيتوبلازم\n   ج) وجود جدار خلوي صلب في الخلية النباتية\n\n4. 'دماغ' الخلية، الذي يحتوي على معلومات لعملها، هو:\n   أ) السيتوبلازم\n   ب) الغشاء\n   ج) النواة",
        "en": "Choose the correct answer for each question.\n\n1. The smallest basic unit of life is:\n   a) The microscope\n   b) The cell\n   c) The nucleus\n\n2. Which instrument is necessary to observe cells?\n   a) A magnifying glass\n   b) Glasses\n   c) A microscope\n\n3. What is the main difference between a plant cell and an animal cell?\n   a) The presence of a nucleus\n   b) The presence of cytoplasm\n   c) The presence of a rigid cell wall in the plant cell\n\n4. The 'brain' of the cell, which contains the information for its functioning, is:\n   a) The cytoplasm\n   b) The membrane\n   c) The nucleus"
      },
      "solution": {
        "fr": "1. **b) La cellule.** La cellule est l'unité structurelle et fonctionnelle de tous les êtres vivants.\n2. **c) Un microscope.** Les cellules sont invisibles à l'œil nu.\n3. **c) La présence d'une paroi cellulaire rigide chez la cellule végétale.** La cellule animale n'a pas de paroi cellulaire.\n4. **c) Le noyau.** Le noyau dirige les activités de la cellule.",
        "ar": "1. **ب) الخلية.** الخلية هي الوحدة التركيبية والوظيفية لجميع الكائنات الحية.\n2. **ج) مجهر.** الخلايا غير مرئية بالعين المجردة.\n3. **ج) وجود جدار خلوي صلب في الخلية النباتية.** الخلية الحيوانية ليس لديها جدار خلوي.\n4. **ج) النواة.** النواة تدير أنشطة الخلية.",
        "en": "1. **b) The cell.** The cell is the structural and functional unit of all living beings.\n2. **c) A microscope.** Cells are invisible to the naked eye.\n3. **c) The presence of a rigid cell wall in the plant cell.** The animal cell does not have a cell wall.\n4. **c) The nucleus.** The nucleus directs the cell's activities."
      }
    },
    {
      "id": "e-1763037175138",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l3",
      "title": {
        "fr": "Identifier les parties de la cellule",
        "ar": "تحديد أجزاء الخلية",
        "en": "Identify the Parts of the Cell"
      },
      "content": {
        "fr": "Légendez les schémas ci-dessous en utilisant les termes de la liste suivante : *Noyau, Cytoplasme, Membrane cytoplasmique, Paroi cellulaire*.\n\n![Schéma d'une cellule animale à gauche et d'une cellule végétale à droite, avec des flèches numérotées pointant vers leurs différentes parties. La cellule animale a 3 flèches, la végétale en a 4.](img_sch_ma_d_une_cellule_animale_gauche_et_d_une_cellu_1763053734263.jpg)",
        "ar": "ضع البيانات على الرسوم التخطيطية أدناه باستخدام المصطلحات من القائمة التالية: *النواة، السيتوبلازم، الغشاء السيتوبلازمي، الجدار الخلوي*.\n\n%%IMAGE_1%%",
        "en": "Label the diagrams below using the terms from the following list: *Nucleus, Cytoplasm, Cytoplasmic membrane, Cell wall*.\n\n%%IMAGE_1%%"
      },
      "solution": {
        "fr": "Voici les schémas avec les légendes correctes.\n\n![Mêmes schémas de cellule animale et végétale que dans l'énoncé, mais avec les légendes correctement remplies : pour la cellule animale, les flèches indiquent la membrane cytoplasmique, le noyau et le cytoplasme. Pour la cellule végétale, les flèches indiquent la paroi cellulaire, la membrane cytoplasmique, le noyau et le cytoplasme.](img_m_mes_sch_mas_de_cellule_animale_et_v_g_tale_que_d_1763053726697.png)\n\n**Cellule Animale :**\n1. Membrane cytoplasmique\n2. Noyau\n3. Cytoplasme\n\n**Cellule Végétale :**\n1. Paroi cellulaire\n2. Membrane cytoplasmique\n3. Noyau\n4. Cytoplasme",
        "ar": "إليك الرسوم التخطيطية مع البيانات الصحيحة.\n\n%%IMAGE_2%%\n\n**الخلية الحيوانية:**\n1. الغشاء السيتوبلازمي\n2. النواة\n3. السيتوبلازم\n\n**الخلية النباتية:**\n1. الجدار الخلوي\n2. الغشاء السيتوبلازمي\n3. النواة\n4. السيتوبلازم",
        "en": "Here are the diagrams with the correct labels.\n\n%%IMAGE_2%%\n\n**Animal Cell:**\n1. Cytoplasmic membrane\n2. Nucleus\n3. Cytoplasm\n\n**Plant Cell:**\n1. Cell wall\n2. Cytoplasmic membrane\n3. Nucleus\n4. Cytoplasm"
      }
    },
    {
      "id": "e-1763037175140",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l3",
      "title": {
        "fr": "Comparer la cellule végétale et la cellule animale",
        "ar": "مقارنة الخلية النباتية والخلية الحيوانية",
        "en": "Compare the Plant Cell and the Animal Cell"
      },
      "content": {
        "fr": "Complétez le tableau comparatif suivant entre la cellule d'oignon (végétale) et la cellule buccale (animale).\n\n| Caractéristique      | Cellule Végétale (Oignon) | Cellule Animale (Buccale) |\n|----------------------|---------------------------|---------------------------|\n| **Forme**            | Géométrique               | ?                         |\n| **Paroi Cellulaire** | ?                         | Absente                   |\n| **Noyau**            | Présent                   | ?                         |\n| **Agencement**       | Rangées comme un mur      | ?                         |",
        "ar": "أكمل جدول المقارنة التالي بين خلية البصل (النباتية) وخلية باطن الفم (الحيوانية).\n\n| الخاصية      | الخلية النباتية (البصل) | الخلية الحيوانية (باطن الفم) |\n|---------------|--------------------------|-------------------------------|\n| **الشكل**    | هندسي                   | ؟                             |\n| **الجدار الخلوي** | ؟                        | غائب                          |\n| **النواة**   | موجودة                   | ؟                             |\n| **الترتيب**   | مرتبة مثل جدار           | ؟                             |",
        "en": "Complete the following comparison table between the onion cell (plant) and the cheek cell (animal).\n\n| Characteristic | Plant Cell (Onion)   | Animal Cell (Cheek) |\n|----------------|----------------------|---------------------|\n| **Shape**      | Geometric            | ?                   |\n| **Cell Wall**  | ?                    | Absent              |\n| **Nucleus**    | Present              | ?                   |\n| **Arrangement**| Arranged like a wall | ?                   |"
      },
      "solution": {
        "fr": "Voici le tableau complété :\n\n| Caractéristique      | Cellule Végétale (Oignon) | Cellule Animale (Buccale)        |\n|----------------------|---------------------------|----------------------------------|\n| **Forme**            | Géométrique               | **Irrégulière**                  |\n| **Paroi Cellulaire** | **Présente**              | Absente                          |\n| **Noyau**            | Présent                   | **Présent**                      |\n| **Agencement**       | Rangées comme un mur      | **Isolées ou en petits groupes** |",
        "ar": "إليك الجدول كاملاً:\n\n| الخاصية      | الخلية النباتية (البصل) | الخلية الحيوانية (باطن الفم)      |\n|---------------|--------------------------|------------------------------------|\n| **الشكل**    | هندسي                   | **غير منتظم**                      |\n| **الجدار الخلوي** | **موجود**                | غائب                               |\n| **النواة**   | موجودة                   | **موجودة**                         |\n| **الترتيب**   | مرتبة مثل جدار           | **معزولة أو في مجموعات صغيرة** |",
        "en": "Here is the completed table:\n\n| Characteristic | Plant Cell (Onion)        | Animal Cell (Cheek)              |\n|----------------|---------------------------|----------------------------------|\n| **Shape**      | Geometric                 | **Irregular**                    |\n| **Cell Wall**  | **Present**               | Absent                           |\n| **Nucleus**    | Present                   | **Present**                      |\n| **Arrangement**| Arranged like a wall      | **Isolated or in small groups**  |"
      }
    },
    {
      "id": "e-1763037175141",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l3",
      "title": {
        "fr": "Vrai ou Faux ? Corrigez si nécessaire",
        "ar": "صحيح أم خطأ؟ صحح إذا لزم الأمر",
        "en": "True or False? Correct if Necessary"
      },
      "content": {
        "fr": "Lisez les affirmations suivantes. Indiquez si elles sont vraies ou fausses. Si une affirmation est fausse, réécrivez-la correctement.\n\n1. Tous les êtres vivants sont constitués de cellules.\n2. La cellule animale possède une paroi rigide qui lui donne sa forme.\n3. Le cytoplasme est le centre de contrôle de la cellule.\n4. On peut observer les cellules de l'intérieur de la joue à l'œil nu.",
        "ar": "اقرأ العبارات التالية. حدد ما إذا كانت صحيحة أم خاطئة. إذا كانت العبارة خاطئة، أعد كتابتها بشكل صحيح.\n\n1. جميع الكائنات الحية تتكون من خلايا.\n2. الخلية الحيوانية تمتلك جدارًا صلبًا يعطيها شكلها.\n3. السيتوبلازم هو مركز التحكم في الخلية.\n4. يمكننا ملاحظة خلايا باطن الخد بالعين المجردة.",
        "en": "Read the following statements. Indicate if they are true or false. If a statement is false, rewrite it correctly.\n\n1. All living things are made of cells.\n2. The animal cell has a rigid wall that gives it its shape.\n3. The cytoplasm is the control center of the cell.\n4. We can observe cheek cells with the naked eye."
      },
      "solution": {
        "fr": "1. **Vrai.** C'est le principe de la théorie cellulaire.\n2. **Faux.** La cellule animale **n'a pas** de paroi rigide. C'est la cellule végétale qui en possède une.\n3. **Faux.** Le **noyau** est le centre de contrôle de la cellule.\n4. **Faux.** On doit utiliser un **microscope** pour observer les cellules car elles sont trop petites.",
        "ar": "1. **صحيح.** هذا هو مبدأ النظرية الخلوية.\n2. **خطأ.** الخلية الحيوانية **لا تمتلك** جدارًا صلبًا. الخلية النباتية هي التي تمتلكه.\n3. **خطأ.** **النواة** هي مركز التحكم في الخلية.\n4. **خطأ.** يجب أن نستخدم **المجهر** لملاحظة الخلايا لأنها صغيرة جدًا.",
        "en": "1. **True.** This is the principle of the cell theory.\n2. **False.** The animal cell **does not have** a rigid wall. It is the plant cell that has one.\n3. **False.** The **nucleus** is the control center of the cell.\n4. **False.** We must use a **microscope** to observe cells because they are too small."
      }
    },
    {
      "id": "e-1763037175142",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l3",
      "title": {
        "fr": "Étude de cas : Analyse d'une observation",
        "ar": "دراسة حالة: تحليل ملاحظة",
        "en": "Case Study: Analysis of an Observation"
      },
      "content": {
        "fr": "Un scientifique observe au microscope un échantillon prélevé sur un être vivant inconnu. Il note les caractéristiques suivantes : \"Les cellules sont de forme géométrique régulière et sont bien rangées les unes contre les autres. Chaque cellule est entourée d'une paroi épaisse et possède un noyau.\"\n\n1. D'après ces observations, l'échantillon provient-il d'un animal ou d'un végétal ?\n2. Justifiez votre réponse en citant deux indices présents dans la description.",
        "ar": "عالم يلاحظ تحت المجهر عينة مأخوذة من كائن حي غير معروف. يسجل الخصائص التالية: \"الخلايا ذات شكل هندسي منتظم ومرتبة بدقة بجانب بعضها البعض. كل خلية محاطة بجدار سميك ولديها نواة.\"\n\n1. بناءً على هذه الملاحظات، هل العينة مأخوذة من حيوان أم نبات؟\n2. برر إجابتك بذكر دليلين من الوصف.",
        "en": "A scientist observes a sample taken from an unknown living being under a microscope. He notes the following characteristics: \"The cells have a regular geometric shape and are neatly arranged against each other. Each cell is surrounded by a thick wall and has a nucleus.\"\n\n1. Based on these observations, does the sample come from an animal or a plant?\n2. Justify your answer by citing two clues from the description."
      },
      "solution": {
        "fr": "1. L'échantillon provient d'un **végétal**.\n2. **Justification :** Les deux indices qui le prouvent sont :\n    - **Indice 1 :** La forme \"géométrique régulière\" et le fait qu'elles soient \"bien rangées\". C'est une caractéristique des cellules végétales.\n    - **Indice 2 :** La présence d'une \"paroi épaisse\" qui entoure chaque cellule. Seules les cellules végétales possèdent cette paroi.",
        "ar": "1. العينة مأخوذة من **نبات**.\n2. **التبرير:** الدليلان اللذان يثبتان ذلك هما:\n    - **الدليل 1:** الشكل \"الهندسي المنتظم\" وكونها \"مرتبة بدقة\". هذه خاصية للخلايا النباتية.\n    - **الدليل 2:** وجود \"جدار سميك\" يحيط بكل خلية. الخلايا النباتية فقط هي التي تمتلك هذا الجدار.",
        "en": "1. The sample comes from a **plant**.\n2. **Justification:** The two clues that prove this are:\n    - **Clue 1:** The \"regular geometric shape\" and the fact that they are \"neatly arranged.\" This is a characteristic of plant cells.\n    - **Clue 2:** The presence of a \"thick wall\" surrounding each cell. Only plant cells have this wall."
      }
    }
  ],
  "summaries": [
    {
      "id": "s-act-1762387563156",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l1",
      "title": {
        "fr": "Bilan des activités",
        "ar": "خلاصة الأنشطة",
        "en": "Summary of Activities"
      },
      "content": {
        "fr": "L'activité principale consistait à explorer et comparer les composantes de trois milieux naturels distincts pour comprendre leur diversité. ![une infographie comparative montrant trois milieux naturels marocains (forêt de Maâmora, lac Dayet Aoua, désert de Merzouga) avec des icônes représentant leurs composantes vivantes et non-vivantes principales.](img_une_infographie_comparative_montrant_trois_milieux_1763827112303.png)\n\n**1. Milieu Forestier (Maâmora)**\n*   **Composantes vivantes :** Chênes-lièges, sangliers, insectes.\n*   **Composantes non-vivantes :** Sol riche en humus, air humide, lumière tamisée.\n\n**2. Milieu Aquatique (Lac Dayet Aoua)**\n*   **Composantes vivantes :** Roseaux, poissons, grenouilles.\n*   **Composantes non-vivantes :** Eau douce, oxygène dissous, fond vaseux.\n\n**3. Milieu Désertique (Merzouga)**\n*   **Composantes vivantes :** Végétaux rares, fennecs, scorpions.\n*   **Composantes non-vivantes :** Sol sableux, air sec, températures extrêmes.",
        "ar": "تمثل النشاط الرئيسي في استكشاف ومقارنة مكونات ثلاثة أوساط طبيعية مختلفة لفهم تنوعها.\n%%IMAGE_1%%\n\n**1. الوسط الغابوي (غابة المعمورة)**\n*   **المكونات الحية:** أشجار بلوط الفلين، الخنازير البرية، الحشرات.\n*   **المكونات غير الحية:** تربة غنية بالدبال، هواء رطب، ضوء خافت.\n\n**2. الوسط المائي (بحيرة ضاية عوا)**\n*   **المكونات الحية:** نبات القصب، الأسماك، الضفادع.\n*   **المكونات غير الحية:** مياه عذبة، أكسجين مذاب، قاع موحل.\n\n**3. الوسط الصحراوي (مرزوكة)**\n*   **المكونات الحية:** نباتات نادرة، ثعالب الفنك، العقارب.\n*   **المكونات غير الحية:** تربة رملية، هواء جاف، درجات حرارة قصوى.",
        "en": "The main activity was to explore and compare the components of three distinct natural environments to understand their diversity.\n%%IMAGE_1%%\n\n**1. Forest Environment (Maâmora)**\n*   **Living components:** Cork oaks, wild boars, insects.\n*   **Non-living components:** Soil rich in humus, humid air, filtered light.\n\n**2. Aquatic Environment (Lake Dayet Aoua)**\n*   **Living components:** Reeds, fish, frogs.\n*   **Non-living components:** Fresh water, dissolved oxygen, muddy bottom.\n\n**3. Desert Environment (Merzouga)**\n*   **Living components:** Rare plants, fennec foxes, scorpions.\n*   **Non-living components:** Sandy soil, dry air, extreme temperatures."
      }
    },
    {
      "id": "s-syn-1762387563156",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l1",
      "title": {
        "fr": "Schéma de synthèse",
        "ar": "حصيلة تركيبية",
        "en": "Synthesis Summary"
      },
      "content": {
        "fr": "Un **milieu naturel** est un **écosystème** formé de deux composantes en interaction :\n*   Le **Biotope** : Les éléments non-vivants (sol, eau, air) et les conditions physico-chimiques (climat, nature du sol).\n*   La **Biocénose** : L'ensemble des êtres vivants (animaux, végétaux).\n\nLa **diversité** des milieux naturels s'explique par la variation des **facteurs climatiques** (température, précipitations, lumière) et **édaphiques** (liés au sol). Chaque être vivant est **adapté** aux conditions spécifiques de son milieu. ![un schéma conceptuel montrant qu'un 'Milieu Naturel' est composé d'un 'Biotope' (facteurs climatiques et édaphiques) et d'une 'Biocénose' (êtres vivants adaptés), avec des flèches montrant les interactions.](img_un_sch_ma_conceptuel_montrant_qu_un_milieu_naturel_1763827126906.png)",
        "ar": "**الوسط الطبيعي** هو **نظام بيئي** يتكون من عنصرين متفاعلين:\n*   **المَحْيَا (Biotope)**: العناصر غير الحية (التربة، الماء، الهواء) والظروف الفيزيائية-الكيميائية (المناخ، طبيعة التربة).\n*   **العشيرة الإحيائية (Biocenosis)**: مجموع الكائنات الحية (الحيوانات، النباتات).\n\nيُفسَّر **تنوع** الأوساط الطبيعية باختلاف **العوامل المناخية** (درجة الحرارة، التساقطات، الإضاءة) و**العوامل التربوية** (المرتبطة بالتربة). كل كائن حي **متكيف** مع الظروف الخاصة بوسط عيشه.\n%%IMAGE_1%%",
        "en": "A **natural environment** is an **ecosystem** formed by two interacting components:\n*   The **Biotope**: The non-living elements (soil, water, air) and the physico-chemical conditions (climate, soil type).\n*   The **Biocenosis**: All the living organisms (animals, plants).\n\nThe **diversity** of natural environments is explained by the variation of **climatic factors** (temperature, precipitation, light) and **edaphic factors** (related to the soil). Each living being is **adapted** to the specific conditions of its environment.\n%%IMAGE_1%%"
      }
    },
    {
      "id": "s-act-1763031303374",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l2",
      "title": {
        "fr": "Bilan des activités",
        "ar": "ملخص الأنشطة",
        "en": "Activities Summary"
      },
      "content": {
        "fr": "Dans un milieu naturel, nous avons appris à différencier deux grands types de composants :\n\n**1. Les composants vivants (la biocénose) :**\n*   **Les animaux :** comme le renard, l'escargot ou l'oiseau.\n    ![Un renard du désert et un oiseau dans un même paysage marocain pour montrer la diversité animale](img_un_renard_du_d_sert_et_un_oiseau_dans_un_m_me_pays_1763827135794.png)\n*   **Les végétaux :** comme le cèdre de l'Atlas ou l'arganier.\n    ![Un arganier majestueux dans la campagne marocaine](img_un_arganier_majestueux_dans_la_campagne_marocaine_1763827141612.png)\n*   **Les micro-organismes :** comme les champignons qui décomposent les feuilles mortes.\n    ![Un gros plan sur des champignons poussant sur un tronc d'arbre au sol](img_un_gros_plan_sur_des_champignons_poussant_sur_un_t_1763827148389.png)\n\n**2. Les composants non-vivants (le biotope) :**\n*   **L'eau :** sous forme de rivière, de lac ou de pluie.\n    ![Une rivière serpentant à travers un paysage montagneux de l'Atlas](img_une_rivi_re_serpentant_travers_un_paysage_montagne_1763827157365.png)\n*   **L'air :** invisible mais essentiel, que le vent nous permet de sentir.\n    ![Des herbes hautes et des arbres se balançant dans le vent](img_des_herbes_hautes_et_des_arbres_se_balan_ant_dans__1763827162359.png)\n*   **Le sol et les roches :** le support de la vie pour les plantes.\n    ![Une vue en coupe du sol montrant les racines d'une plante s'enfonçant dans la terre et les roches en dessous](img_une_vue_en_coupe_du_sol_montrant_les_racines_d_une_1763827167338.png)",
        "ar": "لقد تعلمنا في وسط طبيعي التمييز بين نوعين رئيسيين من المكونات:\n\n**1. المكونات الحية (العشيرة الإحيائية):**\n*   **الحيوانات:** مثل الثعلب، الحلزون أو الطائر.\n    %%IMAGE_1%%\n*   **النباتات:** مثل أرز الأطلس أو شجرة الأرغان.\n    %%IMAGE_2%%\n*   **الكائنات الحية الدقيقة:** مثل الفطريات التي تحلل الأوراق الميتة.\n    %%IMAGE_3%%\n\n**2. المكونات غير الحية (المَحْيَا):**\n*   **الماء:** على شكل نهر، بحيرة أو مطر.\n    %%IMAGE_4%%\n*   **الهواء:** غير مرئي ولكنه ضروري، ونشعر به من خلال الرياح.\n    %%IMAGE_5%%\n*   **التربة والصخور:** دعامة الحياة للنباتات.\n    %%IMAGE_6%%",
        "en": "In a natural environment, we learned to differentiate between two main types of components:\n\n**1. The living components (biocenosis):**\n*   **Animals:** such as the fox, the snail, or the bird.\n    %%IMAGE_1%%\n*   **Plants:** such as the Atlas cedar or the argan tree.\n    %%IMAGE_2%%\n*   **Microorganisms:** such as fungi that decompose dead leaves.\n    %%IMAGE_3%%\n\n**2. The non-living components (biotope):**\n*   **Water:** in the form of a river, lake, or rain.\n    %%IMAGE_4%%\n*   **Air:** invisible but essential, which we can feel as wind.\n    %%IMAGE_5%%\n*   **Soil and rocks:** the support of life for plants.\n    %%IMAGE_6%%"
      }
    },
    {
      "id": "s-syn-1763031303374",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l2",
      "title": {
        "fr": "Schéma de synthèse",
        "ar": "خطاطة تركيبية",
        "en": "Synthesis Summary"
      },
      "content": {
        "fr": "Un milieu naturel est un **écosystème**.\nIl est formé par :\n*   La **biocénose** : L'ensemble de tous les **êtres vivants** (animaux, végétaux, micro-organismes).\n*   Le **biotope** : L'ensemble des **éléments non-vivants** (eau, air, sol, roches) qui constituent le lieu de vie.\n\nLa biocénose et le biotope sont en interaction constante.\n\n**Écosystème = Biocénose (vivants) + Biotope (non-vivants)**\n\n![Un schéma final montrant un cercle 'Écosystème' qui englobe deux cercles intérieurs : 'Biocénose' (avec des icônes d'animal et de plante) et 'Biotope' (avec des icônes d'eau et de roche), avec des flèches indiquant les interactions entre les deux.](img_un_sch_ma_final_montrant_un_cercle_cosyst_me_qui_e_1763827174691.png)",
        "ar": "الوسط الطبيعي هو **نظام بيئي**.\nيتكون من:\n*   **العشيرة الإحيائية (Biocénose)**: مجموع كل **الكائنات الحية** (حيوانات، نباتات، كائنات دقيقة).\n*   **المَحْيَا (Biotope)**: مجموع **العناصر غير الحية** (الماء، الهواء، التربة، الصخور) التي تشكل مكان العيش.\n\nالعشيرة الإحيائية والمَحْيَا في تفاعل مستمر.\n\n**نظام بيئي = عشيرة إحيائية (كائنات حية) + مَحْيَا (عناصر غير حية)**\n\n%%IMAGE_7%%",
        "en": "A natural environment is an **ecosystem**.\nIt is formed by:\n*   The **Biocenosis**: The set of all **living things** (animals, plants, microorganisms).\n*   The **Biotope**: The set of all **non-living elements** (water, air, soil, rocks) that constitute the living place.\n\nThe biocenosis and the biotope are in constant interaction.\n\n**Ecosystem = Biocenosis (living) + Biotope (non-living)**\n\n%%IMAGE_7%%"
      }
    },
    {
      "id": "s-act-1763037175138",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l3",
      "title": {
        "fr": "Bilan des activités",
        "ar": "حصيلة الأنشطة",
        "en": "Activities Summary"
      },
      "content": {
        "fr": "L'observation microscopique de l'épiderme d'oignon et des cellules de la muqueuse buccale nous a permis de découvrir la structure de la cellule.\n\n1.  **Préparation et observation de cellules végétales (oignon) :** Après avoir préparé une lame mince d'épiderme d'oignon avec une goutte d'eau, l'observation au microscope montre des cellules de forme géométrique, bien organisées et dotées d'une paroi rigide. ![Observation de cellules d'épiderme d'oignon](img_dessin_d_observation_de_cellules_d_piderme_d_oigno_1763059062944.jpg)\n\n\n2.  **Préparation et observation de cellules animales (buccales) :** Après avoir réalisé un frottis de l'intérieur de la joue sur une lame et ajouté un colorant (bleu de méthylène), l'observation montre des cellules de forme irrégulière, sans paroi cellulaire visible. ![Observation de cellules de la muqueuse buccale](img_dessin_d_observation_de_cellules_de_la_muqueuse_bu_1763059094950.jpg)\n",
        "ar": "مكنتنا الملاحظة المجهرية لبشرة البصل وخلايا الغشاء المخاطي للفم من اكتشاف بنية الخلية.\n\n1.  **تحضير وملاحظة الخلايا النباتية (البصل):** بعد تحضير صفيحة مجهرية رقيقة من بشرة البصل مع قطرة ماء، تُظهر الملاحظة بالمجهر خلايا ذات شكل هندسي، منظمة جيدًا ومزودة بجدار صلب. %%IMAGE_1%%\n\n2.  **تحضير وملاحظة الخلايا الحيوانية (الفم):** بعد إجراء مسحة من داخل الخد على صفيحة زجاجية وإضافة ملون (أزرق الميثيلين)، تُظهر الملاحظة خلايا ذات شكل غير منتظم، بدون جدار خلوي واضح. %%IMAGE_2%%",
        "en": "Microscopic observation of onion epidermis and cells from the buccal mucosa allowed us to discover the structure of the cell.\n\n1.  **Preparation and observation of plant cells (onion):** After preparing a thin slide of onion epidermis with a drop of water, observation under the microscope shows cells with a geometric shape, well-organized, and equipped with a rigid wall. %%IMAGE_1%%\n\n2.  **Preparation and observation of animal cells (buccal):** After making a smear from the inside of the cheek on a slide and adding a stain (methylene blue), observation shows cells with an irregular shape, without a visible cell wall. %%IMAGE_2%%"
      }
    },
    {
      "id": "s-syn-1763037175138",
      "status": "verified",
      "topicId": "svt-1ac-c1",
      "lessonId": "svt-1ac-l3",
      "title": {
        "fr": "Schéma de synthèse",
        "ar": "خلاصة تركيبية",
        "en": "Synthesis Summary"
      },
      "content": {
        "fr": "*   Tous les êtres vivants (animaux et végétaux) sont constitués d'unités microscopiques appelées **cellules**.\n*   La cellule est l'unité structurelle et fonctionnelle de base de tout être vivant. C'est la **théorie cellulaire**.\n*   Une cellule est généralement composée de trois parties principales : la **membrane cytoplasmique**, le **cytoplasme** et le **noyau**.\n*   La cellule végétale se distingue de la cellule animale principalement par la présence d'une **paroi cellulaire** rigide qui lui donne une forme géométrique.\n\n![Diagramme comparatif](img_diagramme_comparatif_simple_et_l_gend_d_une_cellul_1763059116287.png)",
        "ar": "*   تتكون جميع الكائنات الحية (الحيوانات والنباتات) من وحدات مجهرية تسمى **الخلايا**.\n*   الخلية هي الوحدة التركيبية والوظيفية الأساسية لجميع الكائنات الحية. هذه هي **النظرية الخلوية**.\n*   تتكون الخلية بشكل عام من ثلاثة أجزاء رئيسية: **الغشاء السيتوبلازمي**، و**السيتوبلازم**، و**النواة**.\n*   تتميز الخلية النباتية عن الخلية الحيوانية بشكل أساسي بوجود **جدار خلوي** صلب يمنحها شكلاً هندسياً.\n\n%%IMAGE_1%%",
        "en": "*   All living things (animals and plants) are made up of microscopic units called **cells**.\n*   The cell is the basic structural and functional unit of all living things. This is the **cell theory**.\n*   A cell is generally composed of three main parts: the **cytoplasmic membrane**, the **cytoplasm**, and the **nucleus**.\n*   The plant cell is distinguished from the animal cell mainly by the presence of a rigid **cell wall** which gives it a geometric shape.\n\n%%IMAGE_1%%"
      }
    }
  ]
}